-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Mai
> nDataSet.log
  log type:  text
 opened on:   6 Jul 2024, 09:58:01

. 
. // Load data
. import delimited "/Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capac
> ity/Local_Gov_Dataset_of_Nepal.csv", clear
(encoding automatically selected: UTF-8)
(66 vars, 753 obs)

. 
. // removing empty rows
. drop if missing(unit_name)
(0 observations deleted)

. 
. //droping municipality without data
. drop if lisa_total_100_21_22 == "N/A"
(14 observations deleted)

. replace lisa_total_100_20_21 = lisa_total_100_21_22 if lisa_total_100_20_21 == "N/A"
(47 real changes made)

. 
. 
. // replace lisa_total_100_20_21 =lisa_total_100_21_22 if lisa_total_100_20_21 == "N/A", 
. 
. // changing scores to numbers
. destring lisa_total_100_20_21, replace
lisa_total_100_20_21: all characters numeric; replaced as double

. 
. 
. destring lisa_total_100_21_22, replace
lisa_total_100_21_22: all characters numeric; replaced as double

. 
. 
. egen baseline_nl = rowmean(sum_2014 sum_2015 sum_2016 sum_2017)

. 
. gen log_baseline_nl = log(baseline_nl)

. 
. generate chgnl = (log(sum_2021 - sum_2017))
(4 missing values generated)

. 
. egen lisa_avg = rowmean(lisa_total_100_20_21 lisa_total_100_21_22)

. 
. gen ln_popn = log(popn_2021)

. 
. gen high_school_percent= (popn_highschool_and_equivalent/popn_2021) * 100

. 
. gen urban_num = 0

. replace urban_num = 1 if unit_type != "Gaunpalika"
(286 real changes made)

. 
. gen gov_coalitiion = 0

. replace gov_coalitiion = 1 if politicalaffiliation == "CPN-MC" | politicalaffiliation == "CPN
> -UML" | politicalaffiliation == "FSFN" | politicalaffiliation == "NSP"
(432 real changes made)

. 
. gen female = 0

. replace female = 1 if sex =="Female"
(14 real changes made)

. 
. gen over_65 = 0

. replace over_65 = 1 if ageatelection > 65
(36 real changes made)

. 
. gen ln_area = log(area_kmsq)

. 
. gen ln_educ = log(popn_highschool_and_equivalent)

. 
. // regressions
. 
. regress chgnl lisa_avg, r

Linear regression                               Number of obs     =        735
                                                F(1, 733)         =      26.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0362
                                                Root MSE          =     .91609

------------------------------------------------------------------------------
             |               Robust
       chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    lisa_avg |   .0130183   .0025211     5.16   0.000     .0080689    .0179676
       _cons |   3.767599   .1636015    23.03   0.000     3.446415    4.088782
------------------------------------------------------------------------------

. outreg2 using stataoutput1.doc
command outreg2 is unrecognized
r(199);

end of do-file

r(199);

