-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/MainDataSet.log
  log type:  text
 opened on:   5 Aug 2024, 12:27:33

. 
. // Load data
. import delimited "/Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/instrume
> nt_val.csv", clear
(encoding automatically selected: UTF-8)
(67 vars, 5,116 obs)

. 
. // removing empty rows
. drop if missing(unit_name)
(4,363 observations deleted)

. 
. //droping municipality without data
. drop if lisa_20_21 == "N/A"
(54 observations deleted)

. drop if lisa_21_22 == "N/A"
(8 observations deleted)

. 
. // replace lisa_total_100_20_21 =lisa_total_100_21_22 if lisa_total_100_20_21 == "N/A", 
. 
. // changing scores to numbers
. destring lisa_20_21, replace
lisa_20_21: all characters numeric; replaced as double

. destring lisa_21_22, replace
lisa_21_22: all characters numeric; replaced as double

. 
. 
. egen baseline_nl = rowmean(sum_2014 sum_2015 sum_2016 sum_2017)

. 
. gen ln_baseline_nl_km = log(baseline_nl/area_kmsq)

. 
. generate rel_chgnl  = (log(sum_2021) - log(sum_2017))

. 
. gen ln_popn = log(popn_2021)

. 
. gen high_school_percent= (((popn_highschool+popn_graduate+popn_post_graduate)/popn_2021) * 100)

. 
. gen urban_num = 0

. replace urban_num = 1 if unit_type != "Gaunpalika"
(272 real changes made)

. 
. gen gov_coalitiion = 0

. replace gov_coalitiion = 1 if politicalaffiliation == "CPN-MC" | politicalaffiliation == "CPN-UML" | politicala
> ffiliation == "FSFN" | politicalaffiliation == "NSP"
(406 real changes made)

. 
. gen female = 0

. replace female = 1 if sex =="Female"
(14 real changes made)

. 
. egen lisa_avg = rowmean(lisa_20_21 lisa_21_22)

. 
. 
. // lisa average calculations
. 
. 
. egen gov_magm_avg = rowmean(gov_magm_20_21 gov_magm_21_22)

. gen gov_magm_per = (gov_magm_avg/9) * 100

. 
. egen org_admin_avg = rowmean(org_admin_20_21 org_admin_21_22)

. gen org_admin_per = (org_admin_avg/8) * 100

. 
. egen budg_magm_avg = rowmean(budg_magm_20_21 budg_magm_21_22)

. gen budg_magm_per = (budg_magm_avg/11) * 100

. 
. egen fiscal_magm_avg = rowmean(fiscal_magm_20_21 fiscal_magm_21_22)

. gen fiscal_magm_per = (fiscal_magm_avg/11) * 100

. 
. egen service_dev_avg = rowmean(service_dev_20_21 service_dev_21_22)

. gen service_dev_per = (service_dev_avg/16) * 100

. 
. egen jud_exe_avg = rowmean(jud_exe_20_21 jud_exe_21_22)

. gen jud_exe_per = (jud_exe_avg/9) * 100

. 
. egen phy_infra_avg = rowmean(phy_infra_20_21 phy_infra_21_22)

. gen phy_infra_per = (phy_infra_avg/13) * 100

. 
. egen soc_inc_avg = rowmean(soc_inc_20_21 soc_inc_21_22)

. gen soc_inc_per = (soc_inc_avg/10) * 100

. 
. egen env_protec_avg = rowmean(env_protec_20_21 env_protec_21_22)

. gen env_protec_per = (env_protec_avg/10) * 100

. 
. egen cop_cor_avg = rowmean(cop_cor_20_21 cop_cor_21_22)

. gen cop_cor_per = (cop_cor_avg/6) * 100

. 
. 
. // cooperation and coordination subcateogories averages
. 
. egen a_avg = rowmean(a1 a2)

. egen b_avg = rowmean(b1 b2)

. egen c_avg = rowmean(c1 c2)

. egen d_avg = rowmean(d1 d2)

. egen e_avg = rowmean(e1 e2)

. egen f_avg = rowmean(f1 f2)

. 
. gen fed_cop = ((a_avg + d_avg)/2) * 100

. gen local_cop = ((b_avg + c_avg + e_avg)/3) * 100

. gen ddc_cop = (f_avg) * 100

. 
. gen neighbor_dummy = 0

. replace neighbor_dummy = 1 if neighbor_percent > 20
(279 real changes made)

. 
. gen ln_local_cop = log(local_cop)
(190 missing values generated)

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD22128.000000"

. gen ln_elf = log(elf) + 1

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD22128.000000"

. twoway (scatter rel_chgnl ln_elf) (lfit rel_chgnl ln_elf)

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD22128.000000"

. twoway (scatter rel_chgnl elf) (lfit rel_chgnl elf)

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD22128.000000"

. regress rel_chgnl local_cop, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =      27.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0420
                                                Root MSE          =      .1607

------------------------------------------------------------------------------
             |               Robust
   rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   local_cop |   .0010935   .0002096     5.22   0.000     .0006819    .0015051
       _cons |   .3028634   .0088294    34.30   0.000     .2855277    .3201992
------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(2, 688)         =      32.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1131
                                                Root MSE          =     .15474

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0009742   .0002034     4.79   0.000     .0005749    .0013735
ln_baseline_nl_km |   .0768316   .0134978     5.69   0.000     .0503298    .1033333
            _cons |   .2823885   .0082754    34.12   0.000     .2661404    .2986365
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per, r

Linear regression                               Number of obs     =        691
                                                F(9, 681)         =       8.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1203
                                                Root MSE          =      .1549

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0009519   .0002335     4.08   0.000     .0004934    .0014104
ln_baseline_nl_km |   .0734237   .0135522     5.42   0.000     .0468145    .1000329
     gov_magm_per |   -.000123    .000723    -0.17   0.865    -.0015426    .0012966
    org_admin_per |  -.0005944   .0005477    -1.09   0.278    -.0016698    .0004811
    budg_magm_per |  -.0000152   .0005779    -0.03   0.979      -.00115    .0011195
  fiscal_magm_per |  -.0004046   .0006121    -0.66   0.509    -.0016064    .0007973
    phy_infra_per |    .000747   .0004389     1.70   0.089    -.0001146    .0016087
      soc_inc_per |    .000354   .0003713     0.95   0.341     -.000375    .0010829
   env_protec_per |  -.0002449   .0004945    -0.50   0.621    -.0012158    .0007261
            _cons |   .3218093   .0577291     5.57   0.000     .2084608    .4351578
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf, r

Linear regression                               Number of obs     =        691
                                                F(10, 680)        =      11.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1316
                                                Root MSE          =     .15401

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0008967   .0002313     3.88   0.000     .0004425    .0013509
ln_baseline_nl_km |   .0597428   .0151151     3.95   0.000     .0300649    .0894208
     gov_magm_per |  -.0000256   .0007116    -0.04   0.971    -.0014229    .0013716
    org_admin_per |  -.0005925   .0005423    -1.09   0.275    -.0016573    .0004724
    budg_magm_per |  -.0000794   .0005759    -0.14   0.890    -.0012101    .0010514
  fiscal_magm_per |  -.0003277   .0006052    -0.54   0.588     -.001516    .0008606
    phy_infra_per |   .0006725   .0004395     1.53   0.126    -.0001904    .0015355
      soc_inc_per |   .0004043   .0003677     1.10   0.272    -.0003177    .0011263
   env_protec_per |  -.0002979    .000493    -0.60   0.546     -.001266    .0006702
              elf |   .1242344   .0348596     3.56   0.000     .0557891    .1926797
            _cons |    .227392   .0572474     3.97   0.000     .1149891     .339795
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(11, 679)        =      17.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1912
                                                Root MSE          =     .14874

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007468   .0002221     3.36   0.001     .0003106    .0011829
  ln_baseline_nl_km |   .0294483   .0137788     2.14   0.033     .0023942    .0565024
       gov_magm_per |  -.0004344   .0006976    -0.62   0.534    -.0018041    .0009353
      org_admin_per |  -.0002071   .0005246    -0.39   0.693    -.0012373     .000823
      budg_magm_per |  -6.60e-06   .0005581    -0.01   0.991    -.0011024    .0010892
    fiscal_magm_per |  -.0005654    .000583    -0.97   0.333    -.0017102    .0005794
      phy_infra_per |   .0004954   .0004363     1.14   0.257    -.0003612     .001352
        soc_inc_per |   .0002133   .0003563     0.60   0.550    -.0004864     .000913
     env_protec_per |   -.000794   .0004817    -1.65   0.100    -.0017399    .0001518
                elf |   .1489463   .0311037     4.79   0.000     .0878754    .2100172
high_school_percent |   .0091483   .0013777     6.64   0.000     .0064432    .0118534
              _cons |   .1889153   .0557673     3.39   0.001     .0794183    .2984123
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =      16.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1920
                                                Root MSE          =     .14878

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007624   .0002253     3.38   0.001     .0003201    .0012048
  ln_baseline_nl_km |   .0302148   .0139396     2.17   0.031     .0028448    .0575848
       gov_magm_per |  -.0003781   .0006953    -0.54   0.587    -.0017432     .000987
      org_admin_per |  -.0002166    .000524    -0.41   0.679    -.0012454    .0008122
      budg_magm_per |  -8.71e-06   .0005592    -0.02   0.988    -.0011067    .0010892
    fiscal_magm_per |  -.0005683   .0005826    -0.98   0.330    -.0017123    .0005756
      phy_infra_per |   .0005244   .0004354     1.20   0.229    -.0003305    .0013794
        soc_inc_per |   .0002119    .000358     0.59   0.554     -.000491    .0009148
     env_protec_per |  -.0008439   .0004874    -1.73   0.084     -.001801    .0001131
                elf |    .150872   .0313573     4.81   0.000     .0893028    .2124412
high_school_percent |   .0092127   .0013768     6.69   0.000     .0065094    .0119159
      ageatelection |  -.0005067   .0006238    -0.81   0.417    -.0017315    .0007181
              _cons |   .2077382   .0636457     3.26   0.001     .0827718    .3327047
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =      15.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1953
                                                Root MSE          =     .14858

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007546   .0002253     3.35   0.001     .0003122     .001197
  ln_baseline_nl_km |   .0307201   .0138581     2.22   0.027     .0035102    .0579301
       gov_magm_per |  -.0003963   .0006976    -0.57   0.570     -.001766    .0009734
      org_admin_per |  -.0002136   .0005239    -0.41   0.684    -.0012424    .0008151
      budg_magm_per |   .0000557   .0005647     0.10   0.921    -.0010531    .0011646
    fiscal_magm_per |  -.0005911   .0005866    -1.01   0.314     -.001743    .0005608
      phy_infra_per |   .0005361    .000435     1.23   0.218    -.0003179    .0013902
        soc_inc_per |   .0001693   .0003572     0.47   0.636    -.0005321    .0008708
     env_protec_per |  -.0008312   .0004844    -1.72   0.087    -.0017824    .0001199
                elf |   .1523266   .0313329     4.86   0.000     .0908052     .213848
high_school_percent |   .0090989   .0013796     6.60   0.000       .00639    .0118077
      ageatelection |  -.0004292   .0006291    -0.68   0.495    -.0016645     .000806
             female |   .0681036   .0492785     1.38   0.167    -.0286535    .1648608
              _cons |   .2028122   .0638735     3.18   0.002     .0773983    .3282261
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female politicalaffiliation, r
no observations
r(2000);

end of do-file

r(2000);

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD22128.000000"

. regress rel_chgnl local_cop, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =      27.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0420
                                                Root MSE          =      .1607

------------------------------------------------------------------------------
             |               Robust
   rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   local_cop |   .0010935   .0002096     5.22   0.000     .0006819    .0015051
       _cons |   .3028634   .0088294    34.30   0.000     .2855277    .3201992
------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(2, 688)         =      32.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1131
                                                Root MSE          =     .15474

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0009742   .0002034     4.79   0.000     .0005749    .0013735
ln_baseline_nl_km |   .0768316   .0134978     5.69   0.000     .0503298    .1033333
            _cons |   .2823885   .0082754    34.12   0.000     .2661404    .2986365
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per, r

Linear regression                               Number of obs     =        691
                                                F(9, 681)         =       8.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1203
                                                Root MSE          =      .1549

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0009519   .0002335     4.08   0.000     .0004934    .0014104
ln_baseline_nl_km |   .0734237   .0135522     5.42   0.000     .0468145    .1000329
     gov_magm_per |   -.000123    .000723    -0.17   0.865    -.0015426    .0012966
    org_admin_per |  -.0005944   .0005477    -1.09   0.278    -.0016698    .0004811
    budg_magm_per |  -.0000152   .0005779    -0.03   0.979      -.00115    .0011195
  fiscal_magm_per |  -.0004046   .0006121    -0.66   0.509    -.0016064    .0007973
    phy_infra_per |    .000747   .0004389     1.70   0.089    -.0001146    .0016087
      soc_inc_per |    .000354   .0003713     0.95   0.341     -.000375    .0010829
   env_protec_per |  -.0002449   .0004945    -0.50   0.621    -.0012158    .0007261
            _cons |   .3218093   .0577291     5.57   0.000     .2084608    .4351578
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf, r

Linear regression                               Number of obs     =        691
                                                F(10, 680)        =      11.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1316
                                                Root MSE          =     .15401

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0008967   .0002313     3.88   0.000     .0004425    .0013509
ln_baseline_nl_km |   .0597428   .0151151     3.95   0.000     .0300649    .0894208
     gov_magm_per |  -.0000256   .0007116    -0.04   0.971    -.0014229    .0013716
    org_admin_per |  -.0005925   .0005423    -1.09   0.275    -.0016573    .0004724
    budg_magm_per |  -.0000794   .0005759    -0.14   0.890    -.0012101    .0010514
  fiscal_magm_per |  -.0003277   .0006052    -0.54   0.588     -.001516    .0008606
    phy_infra_per |   .0006725   .0004395     1.53   0.126    -.0001904    .0015355
      soc_inc_per |   .0004043   .0003677     1.10   0.272    -.0003177    .0011263
   env_protec_per |  -.0002979    .000493    -0.60   0.546     -.001266    .0006702
              elf |   .1242344   .0348596     3.56   0.000     .0557891    .1926797
            _cons |    .227392   .0572474     3.97   0.000     .1149891     .339795
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(11, 679)        =      17.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1912
                                                Root MSE          =     .14874

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007468   .0002221     3.36   0.001     .0003106    .0011829
  ln_baseline_nl_km |   .0294483   .0137788     2.14   0.033     .0023942    .0565024
       gov_magm_per |  -.0004344   .0006976    -0.62   0.534    -.0018041    .0009353
      org_admin_per |  -.0002071   .0005246    -0.39   0.693    -.0012373     .000823
      budg_magm_per |  -6.60e-06   .0005581    -0.01   0.991    -.0011024    .0010892
    fiscal_magm_per |  -.0005654    .000583    -0.97   0.333    -.0017102    .0005794
      phy_infra_per |   .0004954   .0004363     1.14   0.257    -.0003612     .001352
        soc_inc_per |   .0002133   .0003563     0.60   0.550    -.0004864     .000913
     env_protec_per |   -.000794   .0004817    -1.65   0.100    -.0017399    .0001518
                elf |   .1489463   .0311037     4.79   0.000     .0878754    .2100172
high_school_percent |   .0091483   .0013777     6.64   0.000     .0064432    .0118534
              _cons |   .1889153   .0557673     3.39   0.001     .0794183    .2984123
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =      16.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1920
                                                Root MSE          =     .14878

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007624   .0002253     3.38   0.001     .0003201    .0012048
  ln_baseline_nl_km |   .0302148   .0139396     2.17   0.031     .0028448    .0575848
       gov_magm_per |  -.0003781   .0006953    -0.54   0.587    -.0017432     .000987
      org_admin_per |  -.0002166    .000524    -0.41   0.679    -.0012454    .0008122
      budg_magm_per |  -8.71e-06   .0005592    -0.02   0.988    -.0011067    .0010892
    fiscal_magm_per |  -.0005683   .0005826    -0.98   0.330    -.0017123    .0005756
      phy_infra_per |   .0005244   .0004354     1.20   0.229    -.0003305    .0013794
        soc_inc_per |   .0002119    .000358     0.59   0.554     -.000491    .0009148
     env_protec_per |  -.0008439   .0004874    -1.73   0.084     -.001801    .0001131
                elf |    .150872   .0313573     4.81   0.000     .0893028    .2124412
high_school_percent |   .0092127   .0013768     6.69   0.000     .0065094    .0119159
      ageatelection |  -.0005067   .0006238    -0.81   0.417    -.0017315    .0007181
              _cons |   .2077382   .0636457     3.26   0.001     .0827718    .3327047
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =      15.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1953
                                                Root MSE          =     .14858

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007546   .0002253     3.35   0.001     .0003122     .001197
  ln_baseline_nl_km |   .0307201   .0138581     2.22   0.027     .0035102    .0579301
       gov_magm_per |  -.0003963   .0006976    -0.57   0.570     -.001766    .0009734
      org_admin_per |  -.0002136   .0005239    -0.41   0.684    -.0012424    .0008151
      budg_magm_per |   .0000557   .0005647     0.10   0.921    -.0010531    .0011646
    fiscal_magm_per |  -.0005911   .0005866    -1.01   0.314     -.001743    .0005608
      phy_infra_per |   .0005361    .000435     1.23   0.218    -.0003179    .0013902
        soc_inc_per |   .0001693   .0003572     0.47   0.636    -.0005321    .0008708
     env_protec_per |  -.0008312   .0004844    -1.72   0.087    -.0017824    .0001199
                elf |   .1523266   .0313329     4.86   0.000     .0908052     .213848
high_school_percent |   .0090989   .0013796     6.60   0.000       .00639    .0118077
      ageatelection |  -.0004292   .0006291    -0.68   0.495    -.0016645     .000806
             female |   .0681036   .0492785     1.38   0.167    -.0286535    .1648608
              _cons |   .2028122   .0638735     3.18   0.002     .0773983    .3282261
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female politicalaffiliation, r
no observations
r(2000);

end of do-file

r(2000);

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD22128.000000"

. regress rel_chgnl local_cop, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =      27.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0420
                                                Root MSE          =      .1607

------------------------------------------------------------------------------
             |               Robust
   rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   local_cop |   .0010935   .0002096     5.22   0.000     .0006819    .0015051
       _cons |   .3028634   .0088294    34.30   0.000     .2855277    .3201992
------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(2, 688)         =      32.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1131
                                                Root MSE          =     .15474

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0009742   .0002034     4.79   0.000     .0005749    .0013735
ln_baseline_nl_km |   .0768316   .0134978     5.69   0.000     .0503298    .1033333
            _cons |   .2823885   .0082754    34.12   0.000     .2661404    .2986365
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per, r

Linear regression                               Number of obs     =        691
                                                F(9, 681)         =       8.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1203
                                                Root MSE          =      .1549

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0009519   .0002335     4.08   0.000     .0004934    .0014104
ln_baseline_nl_km |   .0734237   .0135522     5.42   0.000     .0468145    .1000329
     gov_magm_per |   -.000123    .000723    -0.17   0.865    -.0015426    .0012966
    org_admin_per |  -.0005944   .0005477    -1.09   0.278    -.0016698    .0004811
    budg_magm_per |  -.0000152   .0005779    -0.03   0.979      -.00115    .0011195
  fiscal_magm_per |  -.0004046   .0006121    -0.66   0.509    -.0016064    .0007973
    phy_infra_per |    .000747   .0004389     1.70   0.089    -.0001146    .0016087
      soc_inc_per |    .000354   .0003713     0.95   0.341     -.000375    .0010829
   env_protec_per |  -.0002449   .0004945    -0.50   0.621    -.0012158    .0007261
            _cons |   .3218093   .0577291     5.57   0.000     .2084608    .4351578
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf, r

Linear regression                               Number of obs     =        691
                                                F(10, 680)        =      11.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1316
                                                Root MSE          =     .15401

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0008967   .0002313     3.88   0.000     .0004425    .0013509
ln_baseline_nl_km |   .0597428   .0151151     3.95   0.000     .0300649    .0894208
     gov_magm_per |  -.0000256   .0007116    -0.04   0.971    -.0014229    .0013716
    org_admin_per |  -.0005925   .0005423    -1.09   0.275    -.0016573    .0004724
    budg_magm_per |  -.0000794   .0005759    -0.14   0.890    -.0012101    .0010514
  fiscal_magm_per |  -.0003277   .0006052    -0.54   0.588     -.001516    .0008606
    phy_infra_per |   .0006725   .0004395     1.53   0.126    -.0001904    .0015355
      soc_inc_per |   .0004043   .0003677     1.10   0.272    -.0003177    .0011263
   env_protec_per |  -.0002979    .000493    -0.60   0.546     -.001266    .0006702
              elf |   .1242344   .0348596     3.56   0.000     .0557891    .1926797
            _cons |    .227392   .0572474     3.97   0.000     .1149891     .339795
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(11, 679)        =      17.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1912
                                                Root MSE          =     .14874

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007468   .0002221     3.36   0.001     .0003106    .0011829
  ln_baseline_nl_km |   .0294483   .0137788     2.14   0.033     .0023942    .0565024
       gov_magm_per |  -.0004344   .0006976    -0.62   0.534    -.0018041    .0009353
      org_admin_per |  -.0002071   .0005246    -0.39   0.693    -.0012373     .000823
      budg_magm_per |  -6.60e-06   .0005581    -0.01   0.991    -.0011024    .0010892
    fiscal_magm_per |  -.0005654    .000583    -0.97   0.333    -.0017102    .0005794
      phy_infra_per |   .0004954   .0004363     1.14   0.257    -.0003612     .001352
        soc_inc_per |   .0002133   .0003563     0.60   0.550    -.0004864     .000913
     env_protec_per |   -.000794   .0004817    -1.65   0.100    -.0017399    .0001518
                elf |   .1489463   .0311037     4.79   0.000     .0878754    .2100172
high_school_percent |   .0091483   .0013777     6.64   0.000     .0064432    .0118534
              _cons |   .1889153   .0557673     3.39   0.001     .0794183    .2984123
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =      16.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1920
                                                Root MSE          =     .14878

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007624   .0002253     3.38   0.001     .0003201    .0012048
  ln_baseline_nl_km |   .0302148   .0139396     2.17   0.031     .0028448    .0575848
       gov_magm_per |  -.0003781   .0006953    -0.54   0.587    -.0017432     .000987
      org_admin_per |  -.0002166    .000524    -0.41   0.679    -.0012454    .0008122
      budg_magm_per |  -8.71e-06   .0005592    -0.02   0.988    -.0011067    .0010892
    fiscal_magm_per |  -.0005683   .0005826    -0.98   0.330    -.0017123    .0005756
      phy_infra_per |   .0005244   .0004354     1.20   0.229    -.0003305    .0013794
        soc_inc_per |   .0002119    .000358     0.59   0.554     -.000491    .0009148
     env_protec_per |  -.0008439   .0004874    -1.73   0.084     -.001801    .0001131
                elf |    .150872   .0313573     4.81   0.000     .0893028    .2124412
high_school_percent |   .0092127   .0013768     6.69   0.000     .0065094    .0119159
      ageatelection |  -.0005067   .0006238    -0.81   0.417    -.0017315    .0007181
              _cons |   .2077382   .0636457     3.26   0.001     .0827718    .3327047
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =      15.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1953
                                                Root MSE          =     .14858

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007546   .0002253     3.35   0.001     .0003122     .001197
  ln_baseline_nl_km |   .0307201   .0138581     2.22   0.027     .0035102    .0579301
       gov_magm_per |  -.0003963   .0006976    -0.57   0.570     -.001766    .0009734
      org_admin_per |  -.0002136   .0005239    -0.41   0.684    -.0012424    .0008151
      budg_magm_per |   .0000557   .0005647     0.10   0.921    -.0010531    .0011646
    fiscal_magm_per |  -.0005911   .0005866    -1.01   0.314     -.001743    .0005608
      phy_infra_per |   .0005361    .000435     1.23   0.218    -.0003179    .0013902
        soc_inc_per |   .0001693   .0003572     0.47   0.636    -.0005321    .0008708
     env_protec_per |  -.0008312   .0004844    -1.72   0.087    -.0017824    .0001199
                elf |   .1523266   .0313329     4.86   0.000     .0908052     .213848
high_school_percent |   .0090989   .0013796     6.60   0.000       .00639    .0118077
      ageatelection |  -.0004292   .0006291    -0.68   0.495    -.0016645     .000806
             female |   .0681036   .0492785     1.38   0.167    -.0286535    .1648608
              _cons |   .2028122   .0638735     3.18   0.002     .0773983    .3282261
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female gov_coalitiion, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =      14.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1983
                                                Root MSE          =     .14842

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007572    .000227     3.34   0.001     .0003116    .0012029
  ln_baseline_nl_km |    .029604   .0137059     2.16   0.031     .0026928    .0565152
       gov_magm_per |  -.0003793   .0006917    -0.55   0.584    -.0017374    .0009788
      org_admin_per |   -.000234   .0005223    -0.45   0.654    -.0012595    .0007916
      budg_magm_per |   .0000911   .0005645     0.16   0.872    -.0010173    .0011996
    fiscal_magm_per |  -.0005832   .0005853    -1.00   0.319    -.0017325     .000566
      phy_infra_per |   .0005928    .000433     1.37   0.171    -.0002573    .0014429
        soc_inc_per |   .0001698   .0003578     0.47   0.635    -.0005328    .0008724
     env_protec_per |  -.0008728   .0004883    -1.79   0.074    -.0018316     .000086
                elf |   .1524274   .0311272     4.90   0.000     .0913099     .213545
high_school_percent |   .0093132   .0013858     6.72   0.000     .0065922    .0120341
      ageatelection |  -.0005649   .0006391    -0.88   0.377    -.0018199      .00069
             female |   .0681091   .0506258     1.35   0.179    -.0312936    .1675118
     gov_coalitiion |   -.018607   .0117045    -1.59   0.112    -.0415885    .0043746
              _cons |   .2145304   .0654019     3.28   0.001     .0861151    .3429457
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female gov_coalitiion ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =      14.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2170
                                                Root MSE          =     .14679

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0007117   .0002228     3.19   0.001     .0002742    .0011493
  ln_baseline_nl_km |  -.0016655   .0165366    -0.10   0.920    -.0341348    .0308038
       gov_magm_per |   -.000458   .0006936    -0.66   0.509    -.0018199    .0009039
      org_admin_per |   .0000545   .0005135     0.11   0.915    -.0009536    .0010627
      budg_magm_per |   .0000945   .0005513     0.17   0.864    -.0009879     .001177
    fiscal_magm_per |  -.0006103   .0005813    -1.05   0.294    -.0017517     .000531
      phy_infra_per |   .0003662   .0004322     0.85   0.397    -.0004824    .0012147
        soc_inc_per |   .0001656   .0003478     0.48   0.634    -.0005172    .0008485
     env_protec_per |  -.0011607   .0004839    -2.40   0.017    -.0021109   -.0002105
                elf |   .1152161   .0319026     3.61   0.000     .0525759    .1778563
high_school_percent |   .0090137   .0013534     6.66   0.000     .0063564    .0116711
      ageatelection |  -.0006175   .0006243    -0.99   0.323    -.0018433    .0006083
             female |   .0619148   .0508031     1.22   0.223    -.0378364    .1616659
     gov_coalitiion |  -.0194831    .011578    -1.68   0.093    -.0422164    .0032501
            ln_popn |    .042204   .0093489     4.51   0.000     .0238477    .0605604
              _cons |  -.1606344    .108804    -1.48   0.140    -.3742693    .0530005
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3) 
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl local_cop ln_baseline_nl_km gov_magm_per org_admin_per budg_magm_per fiscal_magm_per phy_infr
> a_per soc_inc_per env_protec_per elf high_school_percent ageatelection female gov_coalitiion ln_popn urban_num,
>  r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =      13.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2217
                                                Root MSE          =     .14646

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |     .00072   .0002218     3.25   0.001     .0002845    .0011555
  ln_baseline_nl_km |  -.0060114   .0168178    -0.36   0.721     -.039033    .0270102
       gov_magm_per |  -.0004916    .000695    -0.71   0.480    -.0018562     .000873
      org_admin_per |   .0000514   .0005072     0.10   0.919    -.0009445    .0010473
      budg_magm_per |   .0000778   .0005552     0.14   0.889    -.0010123    .0011679
    fiscal_magm_per |   -.000725   .0005767    -1.26   0.209    -.0018573    .0004073
      phy_infra_per |   .0004348   .0004292     1.01   0.311    -.0004078    .0012775
        soc_inc_per |   .0001859   .0003464     0.54   0.592    -.0004942     .000866
     env_protec_per |  -.0011184   .0004789    -2.34   0.020    -.0020588    -.000178
                elf |   .1228579   .0329014     3.73   0.000     .0582563    .1874596
high_school_percent |   .0096402   .0014198     6.79   0.000     .0068524     .012428
      ageatelection |  -.0006765   .0006251    -1.08   0.279    -.0019038    .0005508
             female |   .0593652   .0506342     1.17   0.241    -.0400546    .1587849
     gov_coalitiion |  -.0211428   .0115961    -1.82   0.069    -.0439116     .001626
            ln_popn |   .0537033   .0114701     4.68   0.000      .031182    .0762247
          urban_num |  -.0309842   .0167043    -1.85   0.064    -.0637829    .0018145
              _cons |  -.2668872   .1300199    -2.05   0.040    -.5221801   -.0115944
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD22128.000000"

. regress local_cop neighbor_dummy, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       8.52
                                                Prob > F          =     0.0036
                                                R-squared         =     0.0125
                                                Root MSE          =      30.58

--------------------------------------------------------------------------------
               |               Robust
     local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
neighbor_dummy |   6.997585   2.397899     2.92   0.004     2.289519    11.70565
         _cons |   29.59142   1.469972    20.13   0.000     26.70526    32.47759
--------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, replace dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_dummy elf, r

Linear regression                               Number of obs     =        691
                                                F(2, 688)         =      12.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0326
                                                Root MSE          =     30.288

--------------------------------------------------------------------------------
               |               Robust
     local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
neighbor_dummy |   7.951901   2.377575     3.34   0.001     3.283727    12.62008
           elf |   27.86483   6.650161     4.19   0.000     14.80778    40.92187
         _cons |   8.164844   5.152587     1.58   0.114    -1.951838    18.28153
--------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_dummy elf high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(3, 687)         =      23.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0953
                                                Root MSE          =     29.311

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
     neighbor_dummy |   5.407411   2.305915     2.35   0.019     .8799249    9.934897
                elf |   21.70414      6.658     3.26   0.001     8.631668    34.77661
high_school_percent |   1.542584   .2246764     6.87   0.000     1.101449    1.983719
              _cons |  -1.853406   5.452661    -0.34   0.734    -12.55929    8.852475
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_dummy elf high_school_percent ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(4, 686)         =      18.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1054
                                                Root MSE          =      29.17

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
     neighbor_dummy |   5.599441     2.2874     2.45   0.015     1.108296    10.09059
                elf |   12.10237   7.427174     1.63   0.104    -2.480356    26.68509
high_school_percent |   1.324435   .2366268     5.60   0.000     .8598354    1.789035
            ln_popn |   4.671829   1.756468     2.66   0.008     1.223129    8.120528
              _cons |  -40.26504   15.60309    -2.58   0.010    -70.90058     -9.6295
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_dummy elf high_school_percent ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(5, 685)         =      15.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1068
                                                Root MSE          =     29.168

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
     neighbor_dummy |   5.522623   2.286385     2.42   0.016     1.033458    10.01179
                elf |   11.51137   7.475978     1.54   0.124     -3.16721    26.18996
high_school_percent |     1.2699    .243764     5.21   0.000     .7912852    1.748514
            ln_popn |   3.637882   1.967528     1.85   0.065    -.2252292    7.500992
          urban_num |    3.11169   3.015096     1.03   0.302     -2.80825     9.03163
              _cons |  -29.87778   18.18266    -1.64   0.101    -65.57821    5.822651
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_dummy elf high_school_percent ln_popn urban_num ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(6, 684)         =      14.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1128
                                                Root MSE          =      29.09

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
     neighbor_dummy |   5.254692   2.290741     2.29   0.022     .7569632    9.752421
                elf |   10.22465   7.480718     1.37   0.172    -4.463276    24.91258
high_school_percent |    1.22172   .2440976     5.01   0.000     .7424494    1.700991
            ln_popn |   3.315248   1.969284     1.68   0.093    -.5513191    7.181814
          urban_num |    3.40412   3.002896     1.13   0.257    -2.491881    9.300122
      ageatelection |   .2591493   .1263457     2.05   0.041     .0110774    .5072212
              _cons |  -37.68212    18.5791    -2.03   0.043    -74.16104   -1.203197
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_dummy elf high_school_percent ln_popn urban_num ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(7, 683)         =      12.23
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1133
                                                Root MSE          =     29.104

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
     neighbor_dummy |   5.225521   2.289119     2.28   0.023     .7309668    9.720076
                elf |   10.42652   7.498493     1.39   0.165    -4.296351    25.14938
high_school_percent |   1.214189   .2446787     4.96   0.000     .7337766    1.694602
            ln_popn |    3.28838   1.965666     1.67   0.095     -.571095    7.147854
          urban_num |   3.447611   2.999457     1.15   0.251    -2.441654    9.336875
      ageatelection |   .2648616   .1266439     2.09   0.037     .0162035    .5135198
             female |   4.812105    8.23653     0.58   0.559    -11.35985    20.98406
              _cons |   -37.8627   18.57654    -2.04   0.042    -74.33668   -1.388718
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_dummy elf high_school_percent ln_popn urban_num ageatelection female gov_magm_per or
> g_admin_per budg_magm_per fiscal_magm_per phy_infra_per soc_inc_per env_protec_per, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =      29.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3390
                                                Root MSE          =     25.258

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
     neighbor_dummy |   1.799425   2.065435     0.87   0.384    -2.256014    5.854865
                elf |   11.99218   6.749135     1.78   0.076    -1.259609    25.24397
high_school_percent |   .3983793   .2200379     1.81   0.071    -.0336606    .8304192
            ln_popn |   1.361893   1.725898     0.79   0.430    -2.026872    4.750657
          urban_num |   1.397647   2.614389     0.53   0.593    -3.735651    6.530946
      ageatelection |   .2315162   .1081217     2.14   0.033     .0192215     .443811
             female |    3.58035   6.987539     0.51   0.609    -10.13954    17.30024
       gov_magm_per |   .1224753   .1024419     1.20   0.232    -.0786673    .3236179
      org_admin_per |   .0096472   .0810505     0.12   0.905    -.1494939    .1687883
      budg_magm_per |   .0576571   .0980058     0.59   0.557    -.1347753    .2500895
    fiscal_magm_per |   .2112856   .0986937     2.14   0.033     .0175026    .4050686
      phy_infra_per |   .2749851    .079622     3.45   0.001     .1186488    .4313213
        soc_inc_per |   .0722113    .064872     1.11   0.266    -.0551635    .1995861
     env_protec_per |   .4523795   .0942322     4.80   0.000     .2673564    .6374025
              _cons |   -72.3917   16.96208    -4.27   0.000    -105.6964   -39.08701
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
end of do-file

