-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/MainDataSet.log
  log type:  text
 opened on:  11 Jul 2024, 19:25:01

. 
. // Load data
. import delimited "/Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/Local_Gov_Dataset_of
> _Nepal.csv", clear
(encoding automatically selected: UTF-8)
(66 vars, 753 obs)

. 
. // removing empty rows
. drop if missing(unit_name)
(0 observations deleted)

. 
. //droping municipality without data
. drop if lisa_20_21 == "N/A"
(53 observations deleted)

. drop if lisa_21_22 == "N/A"
(8 observations deleted)

. 
. // replace lisa_total_100_20_21 =lisa_total_100_21_22 if lisa_total_100_20_21 == "N/A", 
. 
. // changing scores to numbers
. destring lisa_20_21, replace
lisa_20_21: all characters numeric; replaced as double

. destring lisa_21_22, replace
lisa_21_22: all characters numeric; replaced as double

. 
. 
. egen baseline_nl = rowmean(sum_2014 sum_2015 sum_2016 sum_2017)

. 
. gen log_baseline_nl = log(baseline_nl)

. 
. generate rel_chgnl = (log(sum_2021) - log(sum_2017))

. 
. gen ln_popn = log(popn_2021)

. 
. gen high_school_percent= (popn_highschool_and_equivalent/popn_2021) * 100

. 
. gen urban_num = 0

. replace urban_num = 1 if unit_type != "Gaunpalika"
(272 real changes made)

. 
. gen gov_coalitiion = 0

. replace gov_coalitiion = 1 if politicalaffiliation == "CPN-MC" | politicalaffiliation == "CPN-UML" | politicalaffiliation =
> = "FSFN" | politicalaffiliation == "NSP"
(407 real changes made)

. 
. gen female = 0

. replace female = 1 if sex =="Female"
(14 real changes made)

. 
. gen over_65 = 0

. replace over_65 = 1 if ageatelection > 65
(34 real changes made)

. 
. gen ln_area = log(area_kmsq)

. 
. gen ln_educ = log(popn_highschool_and_equivalent)

. 
. egen lisa_avg = rowmean(lisa_20_21 lisa_21_22)

. 
. 
. //initial regression
. 
. regress rel_chgnl lisa_avg, r

Linear regression                               Number of obs     =        692
                                                F(1, 690)         =       4.27
                                                Prob > F          =     0.0391
                                                R-squared         =     0.0099
                                                Root MSE          =     .16328

------------------------------------------------------------------------------
             |               Robust
   rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    lisa_avg |   .0012633   .0006112     2.07   0.039     .0000633    .0024633
       _cons |   .2596789   .0393339     6.60   0.000     .1824505    .3369073
------------------------------------------------------------------------------

. outreg2 using v4_intial_regression.doc, replace dec(3)
v4_intial_regression.doc
dir : seeout

. 
. regress rel_chgnl lisa_avg high_school_percent, r

Linear regression                               Number of obs     =        692
                                                F(2, 689)         =      19.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0829
                                                Root MSE          =     .15725

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           lisa_avg |   .0000339   .0006099     0.06   0.956    -.0011636    .0012314
high_school_percent |   .0154305   .0025585     6.03   0.000     .0104072    .0204539
              _cons |   .2227384   .0393788     5.66   0.000     .1454216    .3000553
-------------------------------------------------------------------------------------

. outreg2 using v4_intial_regression.doc, append dec(3)
v4_intial_regression.doc
dir : seeout

. 
. regress rel_chgnl lisa_avg high_school_percent, r

Linear regression                               Number of obs     =        692
                                                F(2, 689)         =      19.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0829
                                                Root MSE          =     .15725

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           lisa_avg |   .0000339   .0006099     0.06   0.956    -.0011636    .0012314
high_school_percent |   .0154305   .0025585     6.03   0.000     .0104072    .0204539
              _cons |   .2227384   .0393788     5.66   0.000     .1454216    .3000553
-------------------------------------------------------------------------------------

. outreg2 using v4_intial_regression.doc, append dec(3)
v4_intial_regression.doc
dir : seeout

. 
. regress rel_chgnl lisa_avg high_school_percent ageatelection, r

Linear regression                               Number of obs     =        692
                                                F(3, 688)         =      13.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0835
                                                Root MSE          =     .15732

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           lisa_avg |   .0000133   .0006096     0.02   0.983    -.0011836    .0012103
high_school_percent |   .0153044   .0025495     6.00   0.000     .0102988    .0203101
      ageatelection |   .0004134   .0006041     0.68   0.494    -.0007727    .0015995
              _cons |   .2048963   .0488781     4.19   0.000     .1089281    .3008644
-------------------------------------------------------------------------------------

. outreg2 using v4_intial_regression.doc, append dec(3)
v4_intial_regression.doc
dir : seeout

. 
. regress rel_chgnl lisa_avg high_school_percent ageatelection gov_coalitiion, r

Linear regression                               Number of obs     =        692
                                                F(4, 687)         =      10.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0874
                                                Root MSE          =      .1571

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           lisa_avg |   .0000676   .0006045     0.11   0.911    -.0011192    .0012545
high_school_percent |   .0157411   .0025719     6.12   0.000     .0106915    .0207908
      ageatelection |   .0002647   .0006174     0.43   0.668    -.0009475    .0014769
     gov_coalitiion |  -.0212109   .0124543    -1.70   0.089     -.045664    .0032422
              _cons |   .2180014   .0509216     4.28   0.000     .1180207    .3179821
-------------------------------------------------------------------------------------

. outreg2 using v4_intial_regression.doc, append dec(3)
v4_intial_regression.doc
dir : seeout

. 
. regress rel_chgnl lisa_avg high_school_percent ageatelection gov_coalitiion female, r

Linear regression                               Number of obs     =        692
                                                F(5, 686)         =       9.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0895
                                                Root MSE          =     .15703

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           lisa_avg |   .0000608   .0006052     0.10   0.920    -.0011275    .0012491
high_school_percent |   .0155738   .0025956     6.00   0.000     .0104776      .02067
      ageatelection |   .0003318   .0006228     0.53   0.594    -.0008909    .0015546
     gov_coalitiion |  -.0211558   .0124804    -1.70   0.091    -.0456601    .0033485
             female |   .0533113   .0474294     1.12   0.261    -.0398128    .1464355
              _cons |   .2152889   .0510097     4.22   0.000      .115135    .3154428
-------------------------------------------------------------------------------------

. outreg2 using v4_intial_regression.doc, append dec(3)
v4_intial_regression.doc
dir : seeout

. 
. regress rel_chgnl lisa_avg high_school_percent ageatelection gov_coalitiion female ln_popn, r

Linear regression                               Number of obs     =        692
                                                F(6, 685)         =      23.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1738
                                                Root MSE          =     .14969

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           lisa_avg |  -.0002565   .0005826    -0.44   0.660    -.0014004    .0008873
high_school_percent |     .01254   .0021756     5.76   0.000     .0082684    .0168116
      ageatelection |  -.0001923   .0006089    -0.32   0.752    -.0013879    .0010032
     gov_coalitiion |  -.0196417   .0118042    -1.66   0.097    -.0428184     .003535
             female |   .0558213   .0492895     1.13   0.258    -.0409553    .1525979
            ln_popn |   .0630109    .007072     8.91   0.000     .0491255    .0768963
              _cons |  -.3628645   .0704583    -5.15   0.000    -.5012046   -.2245244
-------------------------------------------------------------------------------------

. outreg2 using v4_intial_regression.doc, append dec(3)
v4_intial_regression.doc
dir : seeout

. 
. // lisa average calculations
. 
. egen gov_magm_avg = rowmean(gov_magm_20_21 gov_magm_21_22)

. egen org_admin_avg = rowmean(org_admin_20_21 org_admin_21_22)

. egen budg_magm_avg = rowmean(budg_magm_20_21 budg_magm_21_22)

. egen fiscal_magm_avg = rowmean(fiscal_magm_20_21 fiscal_magm_21_22)

. egen service_dev_avg = rowmean(service_dev_20_21 service_dev_21_22)

. egen jud_exe_avg = rowmean(jud_exe_20_21 jud_exe_21_22)

. egen phy_infra_avg = rowmean(phy_infra_20_21 phy_infra_21_22)

. egen soc_inc_avg = rowmean(soc_inc_20_21 soc_inc_21_22)

. egen env_protec_avg = rowmean(env_protec_20_21 env_protec_21_22)

. egen cop_cor_avg = rowmean(cop_cor_20_21 cop_cor_21_22)

. 
. 
. //regressions in LISA breakdown
. 
. regress rel_chgnl gov_magm_avg, r

Linear regression                               Number of obs     =        692
                                                F(1, 690)         =       0.47
                                                Prob > F          =     0.4934
                                                R-squared         =     0.0010
                                                Root MSE          =     .16401

------------------------------------------------------------------------------
             |               Robust
   rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
gov_magm_avg |   .0051195   .0074713     0.69   0.493    -.0095497    .0197887
       _cons |   .3001091   .0571334     5.25   0.000      .187933    .4122852
------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, replace dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg, r

Linear regression                               Number of obs     =        692
                                                F(2, 689)         =       0.36
                                                Prob > F          =     0.6952
                                                R-squared         =     0.0013
                                                Root MSE          =      .1641

-------------------------------------------------------------------------------
              |               Robust
    rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
 gov_magm_avg |    .007312   .0085758     0.85   0.394    -.0095259    .0241499
org_admin_avg |  -.0026679   .0060462    -0.44   0.659     -.014539    .0092032
        _cons |   .2985274   .0569852     5.24   0.000     .1866419     .410413
-------------------------------------------------------------------------------

. outreg2 using lisa_regression.doc, append dec(3)
lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg, r

Linear regression                               Number of obs     =        692
                                                F(3, 688)         =       1.11
                                                Prob > F          =     0.3460
                                                R-squared         =     0.0054
                                                Root MSE          =     .16389

-------------------------------------------------------------------------------
              |               Robust
    rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
 gov_magm_avg |   .0027279   .0086523     0.32   0.753    -.0142602    .0197161
org_admin_avg |  -.0065421   .0065063    -1.01   0.315    -.0193167    .0062326
budg_magm_avg |   .0088101    .005187     1.70   0.090    -.0013742    .0189944
        _cons |   .2918545   .0576619     5.06   0.000     .1786401    .4050688
-------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl  gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg, r

Linear regression                               Number of obs     =        692
                                                F(4, 687)         =       1.09
                                                Prob > F          =     0.3612
                                                R-squared         =     0.0064
                                                Root MSE          =     .16392

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_avg |   .0042088   .0083445     0.50   0.614    -.0121749    .0205926
  org_admin_avg |  -.0047633   .0069799    -0.68   0.495    -.0184679    .0089412
  budg_magm_avg |   .0104903   .0055913     1.88   0.061    -.0004879    .0214685
fiscal_magm_avg |  -.0046944   .0058685    -0.80   0.424    -.0162167    .0068279
          _cons |   .2966853   .0592699     5.01   0.000     .1803134    .4130571
---------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg service_dev_avg, r

Linear regression                               Number of obs     =        692
                                                F(5, 686)         =       2.30
                                                Prob > F          =     0.0435
                                                R-squared         =     0.0142
                                                Root MSE          =      .1634

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_avg |  -.0010073   .0087517    -0.12   0.908    -.0181906     .016176
  org_admin_avg |  -.0095617   .0069613    -1.37   0.170    -.0232298    .0041064
  budg_magm_avg |   .0080871   .0055694     1.45   0.147     -.002848    .0190222
fiscal_magm_avg |  -.0084106   .0061653    -1.36   0.173    -.0205157    .0036946
service_dev_avg |   .0102158   .0038675     2.64   0.008     .0026221    .0178094
          _cons |   .2969637   .0589129     5.04   0.000     .1812924    .4126349
---------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg service_dev_avg jud_exe_avg, r

Linear regression                               Number of obs     =        692
                                                F(6, 685)         =       1.96
                                                Prob > F          =     0.0699
                                                R-squared         =     0.0142
                                                Root MSE          =     .16352

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_avg |  -.0010511   .0083277    -0.13   0.900     -.017402    .0152999
  org_admin_avg |  -.0095419    .006873    -1.39   0.165    -.0230365    .0039527
  budg_magm_avg |   .0080853   .0055721     1.45   0.147    -.0028551    .0190258
fiscal_magm_avg |  -.0084402   .0058871    -1.43   0.152    -.0199991    .0031187
service_dev_avg |   .0101784   .0044484     2.29   0.022     .0014442    .0189125
    jud_exe_avg |   .0001771   .0063012     0.03   0.978    -.0121949    .0125491
          _cons |   .2968688   .0604024     4.91   0.000     .1782728    .4154649
---------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg service_dev_avg jud_exe_avg phy_infra_avg, r

Linear regression                               Number of obs     =        692
                                                F(7, 684)         =       3.73
                                                Prob > F          =     0.0006
                                                R-squared         =     0.0325
                                                Root MSE          =     .16211

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_avg |  -.0032671   .0082545    -0.40   0.692    -.0194743      .01294
  org_admin_avg |  -.0109726   .0068303    -1.61   0.109    -.0243834    .0024382
  budg_magm_avg |   .0037904    .005573     0.68   0.497    -.0071519    .0147327
fiscal_magm_avg |   -.009765   .0059504    -1.64   0.101    -.0214482    .0019182
service_dev_avg |   .0072185   .0045227     1.60   0.111    -.0016616    .0160986
    jud_exe_avg |  -.0030486   .0063702    -0.48   0.632    -.0155562    .0094589
  phy_infra_avg |   .0124559   .0032594     3.82   0.000     .0060563    .0188556
          _cons |   .3367034   .0610513     5.52   0.000     .2168329    .4565738
---------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg service_dev_avg jud_exe_avg phy_infra_avg soc_in
> c_avg, r

Linear regression                               Number of obs     =        692
                                                F(8, 683)         =       3.35
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0328
                                                Root MSE          =      .1622

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_avg |  -.0033843   .0082692    -0.41   0.682    -.0196204    .0128519
  org_admin_avg |  -.0113252   .0068269    -1.66   0.098    -.0247294     .002079
  budg_magm_avg |   .0035755   .0055812     0.64   0.522    -.0073828    .0145338
fiscal_magm_avg |   -.009794   .0059472    -1.65   0.100    -.0214709    .0018829
service_dev_avg |   .0066327   .0047366     1.40   0.162    -.0026673    .0159327
    jud_exe_avg |  -.0030888   .0063723    -0.48   0.628    -.0156004    .0094228
  phy_infra_avg |   .0121723   .0033385     3.65   0.000     .0056173    .0187274
    soc_inc_avg |   .0018297   .0037254     0.49   0.623     -.005485    .0091444
          _cons |   .3396998   .0612122     5.55   0.000     .2195132    .4598864
---------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg service_dev_avg jud_exe_avg phy_infra_avg soc_in
> c_avg env_protec_avg, r

Linear regression                               Number of obs     =        692
                                                F(9, 682)         =       3.16
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0348
                                                Root MSE          =     .16216

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_avg |   -.003651    .008309    -0.44   0.661    -.0199653    .0126633
  org_admin_avg |  -.0117845   .0068762    -1.71   0.087    -.0252857    .0017166
  budg_magm_avg |   .0031098   .0055837     0.56   0.578    -.0078536    .0140732
fiscal_magm_avg |  -.0099241   .0059434    -1.67   0.095    -.0215936    .0017455
service_dev_avg |   .0062828   .0047771     1.32   0.189    -.0030968    .0156624
    jud_exe_avg |  -.0036116   .0063193    -0.57   0.568    -.0160193    .0087961
  phy_infra_avg |   .0108296   .0035077     3.09   0.002     .0039425    .0177168
    soc_inc_avg |   .0004826    .003839     0.13   0.900     -.007055    .0080202
 env_protec_avg |   .0064349   .0052311     1.23   0.219    -.0038361    .0167058
          _cons |   .3442296    .061364     5.61   0.000     .2237445    .4647147
---------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg service_dev_avg jud_exe_avg phy_infra_avg soc_in
> c_avg env_protec_avg cop_cor_avg, r

Linear regression                               Number of obs     =        692
                                                F(10, 681)        =       4.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0531
                                                Root MSE          =     .16073

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_avg |  -.0062419   .0082697    -0.75   0.451    -.0224791    .0099953
  org_admin_avg |  -.0120009   .0068538    -1.75   0.080     -.025458    .0014563
  budg_magm_avg |   .0032345   .0054311     0.60   0.552    -.0074292    .0138982
fiscal_magm_avg |  -.0110261   .0058418    -1.89   0.060    -.0224963    .0004441
service_dev_avg |    .006051    .004759     1.27   0.204    -.0032931    .0153952
    jud_exe_avg |  -.0047486   .0062619    -0.76   0.449    -.0170435    .0075464
  phy_infra_avg |    .008478   .0035387     2.40   0.017     .0015299    .0154261
    soc_inc_avg |   -.001251   .0039488    -0.32   0.751    -.0090042    .0065023
 env_protec_avg |   .0020352   .0051377     0.40   0.692    -.0080524    .0121229
    cop_cor_avg |   .0180003   .0047435     3.79   0.000     .0086867    .0273139
          _cons |    .384747   .0624444     6.16   0.000     .2621402    .5073537
---------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_avg org_admin_avg budg_magm_avg fiscal_magm_avg service_dev_avg jud_exe_avg phy_infra_avg soc_in
> c_avg env_protec_avg cop_cor_avg high_school_percent, r

Linear regression                               Number of obs     =        692
                                                F(11, 680)        =       7.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1193
                                                Root MSE          =     .15512

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_avg |  -.0096758   .0082652    -1.17   0.242    -.0259041    .0065526
      org_admin_avg |  -.0064958   .0066585    -0.98   0.330    -.0195695    .0065778
      budg_magm_avg |   .0028488   .0052694     0.54   0.589    -.0074975     .013195
    fiscal_magm_avg |  -.0098934   .0056791    -1.74   0.082     -.021044    .0012573
    service_dev_avg |   .0054291   .0046084     1.18   0.239    -.0036194    .0144776
        jud_exe_avg |  -.0115926   .0061827    -1.88   0.061     -.023732    .0005468
      phy_infra_avg |   .0070822   .0034724     2.04   0.042     .0002643    .0139001
        soc_inc_avg |  -.0028904   .0037988    -0.76   0.447    -.0103492    .0045684
     env_protec_avg |  -.0025381   .0049475    -0.51   0.608    -.0122524    .0071762
        cop_cor_avg |   .0162241   .0045818     3.54   0.000     .0072279    .0252203
high_school_percent |   .0152174   .0025925     5.87   0.000     .0101271    .0203076
              _cons |   .3459769   .0618356     5.60   0.000     .2245654    .4673885
-------------------------------------------------------------------------------------

. outreg2 using v4_lisa_regression.doc, append dec(3)
v4_lisa_regression.doc
dir : seeout

. 
. // revised regression
. 
. regress rel_chgnl phy_infra_avg, r

Linear regression                               Number of obs     =        692
                                                F(1, 690)         =      10.62
                                                Prob > F          =     0.0012
                                                R-squared         =     0.0196
                                                Root MSE          =     .16247

-------------------------------------------------------------------------------
              |               Robust
    rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
phy_infra_avg |   .0096567   .0029633     3.26   0.001     .0038385    .0154749
        _cons |   .2796695   .0192784    14.51   0.000     .2418181    .3175208
-------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, replace dec(3)
v4_revised_regression.doc
dir : seeout

. 
. regress rel_chgnl phy_infra_avg cop_cor_avg, r

Linear regression                               Number of obs     =        692
                                                F(2, 689)         =      10.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0333
                                                Root MSE          =     .16145

-------------------------------------------------------------------------------
              |               Robust
    rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
phy_infra_avg |    .004616   .0032925     1.40   0.161    -.0018486    .0110806
  cop_cor_avg |   .0141925   .0044112     3.22   0.001     .0055314    .0228536
        _cons |   .2799535   .0192308    14.56   0.000     .2421956    .3177115
-------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, append dec(3)
v4_revised_regression.doc
dir : seeout

. 
. regress rel_chgnl phy_infra_avg cop_cor_avg high_school_percent, r

Linear regression                               Number of obs     =        692
                                                F(3, 688)         =      14.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0932
                                                Root MSE          =     .15648

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
      phy_infra_avg |   .0008771   .0032671     0.27   0.788    -.0055376    .0072919
        cop_cor_avg |   .0101191   .0042467     2.38   0.017     .0017811    .0184571
high_school_percent |    .013882   .0025122     5.53   0.000     .0089495    .0188146
              _cons |   .2093196   .0239618     8.74   0.000     .1622726    .2563666
-------------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, append dec(3)
v4_revised_regression.doc
dir : seeout

. 
. regress rel_chgnl phy_infra_avg cop_cor_avg high_school_percent ageatelection, r

Linear regression                               Number of obs     =        692
                                                F(4, 687)         =      10.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0933
                                                Root MSE          =     .15658

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
      phy_infra_avg |   .0008334   .0032583     0.26   0.798    -.0055639    .0072307
        cop_cor_avg |   .0100073   .0042924     2.33   0.020     .0015794    .0184351
high_school_percent |   .0138272   .0025057     5.52   0.000     .0089075    .0187469
      ageatelection |   .0002134    .000604     0.35   0.724    -.0009726    .0013993
              _cons |   .1998799   .0381863     5.23   0.000      .124904    .2748557
-------------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, append dec(3)
v4_revised_regression.doc
dir : seeout

. 
. regress rel_chgnl phy_infra_avg cop_cor_avg high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        692
                                                F(5, 686)         =       9.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0954
                                                Root MSE          =     .15652

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
      phy_infra_avg |   .0008937   .0032598     0.27   0.784    -.0055067    .0072942
        cop_cor_avg |   .0099112   .0042844     2.31   0.021      .001499    .0183233
high_school_percent |   .0136537    .002526     5.41   0.000     .0086942    .0186133
      ageatelection |   .0002789   .0006095     0.46   0.647    -.0009179    .0014757
             female |   .0525288   .0464966     1.13   0.259     -.038764    .1438216
              _cons |   .1967514   .0382883     5.14   0.000      .121575    .2719278
-------------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, append dec(3)
v4_revised_regression.doc
dir : seeout

. 
. regress rel_chgnl phy_infra_avg cop_cor_avg high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        692
                                                F(5, 686)         =       9.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0954
                                                Root MSE          =     .15652

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
      phy_infra_avg |   .0008937   .0032598     0.27   0.784    -.0055067    .0072942
        cop_cor_avg |   .0099112   .0042844     2.31   0.021      .001499    .0183233
high_school_percent |   .0136537    .002526     5.41   0.000     .0086942    .0186133
      ageatelection |   .0002789   .0006095     0.46   0.647    -.0009179    .0014757
             female |   .0525288   .0464966     1.13   0.259     -.038764    .1438216
              _cons |   .1967514   .0382883     5.14   0.000      .121575    .2719278
-------------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, append dec(3)
v4_revised_regression.doc
dir : seeout

. 
. regress rel_chgnl phy_infra_avg cop_cor_avg high_school_percent ageatelection female gov_coalitiion, r

Linear regression                               Number of obs     =        692
                                                F(6, 685)         =       9.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0997
                                                Root MSE          =     .15626

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
      phy_infra_avg |   .0013837   .0032305     0.43   0.669    -.0049592    .0077265
        cop_cor_avg |   .0097427   .0042908     2.27   0.023      .001318    .0181674
high_school_percent |   .0141113   .0025325     5.57   0.000      .009139    .0190837
      ageatelection |   .0001183   .0006224     0.19   0.849    -.0011038    .0013404
             female |   .0523973   .0481055     1.09   0.276    -.0420546    .1468491
     gov_coalitiion |  -.0224451   .0124408    -1.80   0.072    -.0468718    .0019816
              _cons |   .2117722   .0406064     5.22   0.000     .1320442    .2915002
-------------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, append dec(3)
v4_revised_regression.doc
dir : seeout

. 
. regress rel_chgnl phy_infra_avg cop_cor_avg high_school_percent ageatelection female gov_coalitiion ln_popn, r

Linear regression                               Number of obs     =        692
                                                F(7, 684)         =      20.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1796
                                                Root MSE          =     .14928

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
      phy_infra_avg |  -.0025734   .0031631    -0.81   0.416     -.008784    .0036372
        cop_cor_avg |   .0095814    .004091     2.34   0.019      .001549    .0176139
high_school_percent |   .0115359   .0021702     5.32   0.000     .0072749    .0157969
      ageatelection |  -.0003271   .0006089    -0.54   0.591    -.0015227    .0008685
             female |   .0540479   .0501637     1.08   0.282    -.0444453    .1525412
     gov_coalitiion |  -.0197596   .0117527    -1.68   0.093    -.0428352    .0033161
            ln_popn |   .0622762   .0073735     8.45   0.000     .0477987    .0767536
              _cons |  -.3621136    .071367    -5.07   0.000    -.5022382   -.2219889
-------------------------------------------------------------------------------------

. outreg2 using v4_revised_regression.doc, append dec(3)
v4_revised_regression.doc
dir : seeout

. 
. 
. 
. 
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_educ ln_popn, r
. //
. // regress rel_chgnl lisa_avg log_baseline_nl high_school_percent, r
. //
. // regress rel_chgnl_2 lisa_avg, r
. // eststo model1
. //
. // regress rel_chgnl_2 lisa_avg log_baseline_nl ln_educ, r
. // eststo model2
. //
. // regress rel_chgnl_2 lisa_avg log_baseline_nl ln_educ ln_popn, r
. //
. // regress rel_chgnl_2 lisa_avg log_baseline_nl high_school_percent, r
. //
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_popn ln_area ln_educ, r
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_popn ln_area , r
. // eststo model3
. //
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_popn high_school_percent , r
. // eststo model4
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_popn high_school_percent urban_num, r
. // eststo model5
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_popn high_school_percent urban_num ageatelection, r
. // eststo model6
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_popn high_school_percent urban_num ageatelection female, r
. // eststo model7
. //
. // regress rel_chgnl lisa_avg log_baseline_nl ln_popn high_school_percent urban_num ageatelection female gov_coalitiion, r
. // eststo model8
. //
. // esttab model1 model2 model3 model4 model5 model6 model7 model8 using regression_table.txt, replace ///
. // b(3) se(3) t(3) star(* 0.10 ** 0.05 *** 0.01) ///
. // title("Regression Results") ///
. // keep(lisa_avg log_baseline_nl ln_popn urban_num gov_coalitiion ageatelection female high_school_percent _cons) ///
. // order(lisa_avg log_baseline_nl ln_popn high_school_percent urban_num gov_coalitiion ageatelection female  _cons) ///
. // stats(N r2, labels(Observations "R-squared")) ///
. //
. // // use vif here to check multicollinearity
. //
. // // //graphs
. //
. // graph bar (mean) sum_2021 (mean) sum_2017 (mean) sum_2016 (mean) sum_2015 (mean) sum_2014 (mean) sum_2013 (mean) sum_201
> 2
. //
. //
. // graph box rel_chgnl, over(province)
. //
. // summarize rel_chgnl
. //
. // graph box lisa_avg, over(province)
. //
. // twoway (scatter rel_chgnl lisa_avg) (lfit rel_chgnl lisa_avg)
. //
. // graph box high_school_percent, over(province)
. //
. // twoway (scatter rel_chgnl high_school_percent) (lfit rel_chgnl high_school_percent)
. //
. // graph box rel_chgnl, over(female)
. //
. // graph box ageatelection, over(province)
. //
. // twoway (scatter rel_chgnl ageatelection) (lfit rel_chgnl ageatelection) 
. //
. // scatter rel_chgnl ageatelection if gov_coalitiion == 0, mcolor(red) || scatter rel_chgnl ageatelection if gov_coalitiion
>  == 1, mcolor(green)
. 
. 
. 
. 
. 
. 
. 
end of do-file

