-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/MainDataSet.log
  log type:  text
 opened on:  24 Jul 2024, 08:42:29

. 
. // Load data
. import delimited "/Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/instrument_val.csv",
>  clear
(encoding automatically selected: UTF-8)
(66 vars, 5,116 obs)

. 
. // removing empty rows
. drop if missing(unit_name)
(4,363 observations deleted)

. 
. //droping municipality without data
. drop if lisa_20_21 == "N/A"
(54 observations deleted)

. drop if lisa_21_22 == "N/A"
(8 observations deleted)

. 
. // replace lisa_total_100_20_21 =lisa_total_100_21_22 if lisa_total_100_20_21 == "N/A", 
. 
. // changing scores to numbers
. destring lisa_20_21, replace
lisa_20_21: all characters numeric; replaced as double

. destring lisa_21_22, replace
lisa_21_22: all characters numeric; replaced as double

. 
. 
. egen baseline_nl = rowmean(sum_2014 sum_2015 sum_2016 sum_2017)

. 
. gen ln_baseline_nl_km = log(baseline_nl/area_kmsq)

. 
. generate rel_chgnl  = (log(sum_2021) - log(sum_2017))

. 
. gen ln_popn = log(popn_2021)

. 
. gen high_school_percent= (((popn_highschool+popn_graduate+popn_post_graduate)/popn_2021) * 100)

. 
. gen urban_num = 0

. replace urban_num = 1 if unit_type != "Gaunpalika"
(272 real changes made)

. 
. gen gov_coalitiion = 0

. replace gov_coalitiion = 1 if politicalaffiliation == "CPN-MC" | politicalaffiliation == "CPN-UML" | politicalaffiliation =
> = "FSFN" | politicalaffiliation == "NSP"
(406 real changes made)

. 
. gen female = 0

. replace female = 1 if sex =="Female"
(14 real changes made)

. 
. egen lisa_avg = rowmean(lisa_20_21 lisa_21_22)

. 
. 
. // lisa average calculations
. 
. 
. egen gov_magm_avg = rowmean(gov_magm_20_21 gov_magm_21_22)

. gen gov_magm_per = (gov_magm_avg/9) * 100

. 
. egen org_admin_avg = rowmean(org_admin_20_21 org_admin_21_22)

. gen org_admin_per = (org_admin_avg/8) * 100

. 
. egen budg_magm_avg = rowmean(budg_magm_20_21 budg_magm_21_22)

. gen budg_magm_per = (budg_magm_avg/11) * 100

. 
. egen fiscal_magm_avg = rowmean(fiscal_magm_20_21 fiscal_magm_21_22)

. gen fiscal_magm_per = (fiscal_magm_avg/11) * 100

. 
. egen service_dev_avg = rowmean(service_dev_20_21 service_dev_21_22)

. gen service_dev_per = (service_dev_avg/16) * 100

. 
. egen jud_exe_avg = rowmean(jud_exe_20_21 jud_exe_21_22)

. gen jud_exe_per = (jud_exe_avg/9) * 100

. 
. egen phy_infra_avg = rowmean(phy_infra_20_21 phy_infra_21_22)

. gen phy_infra_per = (phy_infra_avg/13) * 100

. 
. egen soc_inc_avg = rowmean(soc_inc_20_21 soc_inc_21_22)

. gen soc_inc_per = (soc_inc_avg/10) * 100

. 
. egen env_protec_avg = rowmean(env_protec_20_21 env_protec_21_22)

. gen env_protec_per = (env_protec_avg/10) * 100

. 
. egen cop_cor_avg = rowmean(cop_cor_20_21 cop_cor_21_22)

. gen cop_cor_per = (cop_cor_avg/6) * 100

. 
. 
. // cooperation and coordination subcateogories averages
. 
. egen a_avg = rowmean(a1 a2)

. egen b_avg = rowmean(b1 b2)

. egen c_avg = rowmean(c1 c2)

. egen d_avg = rowmean(d1 d2)

. egen e_avg = rowmean(e1 e2)

. egen f_avg = rowmean(f1 f2)

. 
. gen fed_cop = ((a_avg + d_avg)/2) * 100

. gen local_cop = ((b_avg + c_avg + e_avg)/3) * 100

. gen ddc_cop = (f_avg) * 100

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =       4.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0634
                                                Root MSE          =     .16018

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_per |  -.0003768   .0007463    -0.50   0.614    -.0018421    .0010884
  org_admin_per |  -.0008685    .000559    -1.55   0.121    -.0019661    .0002291
  budg_magm_per |   .0002557   .0005985     0.43   0.669    -.0009194    .0014308
fiscal_magm_per |   -.001212   .0006408    -1.89   0.059    -.0024702    .0000462
service_dev_per |   .0008511   .0007624     1.12   0.265    -.0006457     .002348
    jud_exe_per |  -.0004291    .000566    -0.76   0.449    -.0015405    .0006822
  phy_infra_per |   .0010623   .0004551     2.33   0.020     .0001687     .001956
    soc_inc_per |   .0000415   .0004016     0.10   0.918    -.0007469    .0008299
 env_protec_per |   .0001394   .0005081     0.27   0.784    -.0008582     .001137
        fed_cop |   -.000114   .0002821    -0.40   0.686    -.0006679    .0004398
      local_cop |   .0011702   .0002748     4.26   0.000     .0006306    .0017098
        ddc_cop |  -.0000938   .0001835    -0.51   0.609    -.0004541    .0002664
          _cons |   .3817987   .0623927     6.12   0.000     .2592925    .5043049
---------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =       6.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1219
                                                Root MSE          =     .15522

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
     gov_magm_per |  -.0002496   .0007197    -0.35   0.729    -.0016628    .0011636
    org_admin_per |  -.0007287   .0005383    -1.35   0.176    -.0017856    .0003282
    budg_magm_per |  -.0000705   .0005821    -0.12   0.904    -.0012135    .0010724
  fiscal_magm_per |  -.0005432   .0006234    -0.87   0.384    -.0017671    .0006808
  service_dev_per |   .0007813   .0007467     1.05   0.296    -.0006848    .0022474
      jud_exe_per |  -.0001081   .0005544    -0.19   0.845    -.0011966    .0009804
    phy_infra_per |   .0007089   .0004417     1.60   0.109    -.0001584    .0015761
      soc_inc_per |   .0002529    .000394     0.64   0.521    -.0005206    .0010265
   env_protec_per |  -.0002621   .0004946    -0.53   0.596    -.0012333    .0007092
          fed_cop |   .0000164   .0002778     0.06   0.953    -.0005291    .0005619
        local_cop |   .0009602   .0002727     3.52   0.000     .0004248    .0014957
          ddc_cop |  -.0000594   .0001768    -0.34   0.737    -.0004065    .0002877
ln_baseline_nl_km |   .0730885   .0135189     5.41   0.000     .0465444    .0996325
            _cons |    .318183   .0604668     5.26   0.000     .1994579    .4369081
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =       9.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1783
                                                Root MSE          =     .15026

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005011   .0007105    -0.71   0.481    -.0018962    .0008939
      org_admin_per |   -.000372   .0005204    -0.71   0.475    -.0013938    .0006498
      budg_magm_per |   .0000156    .000566     0.03   0.978    -.0010957    .0011269
    fiscal_magm_per |   -.000639   .0006049    -1.06   0.291    -.0018268    .0005487
    service_dev_per |   .0006663    .000722     0.92   0.356    -.0007514     .002084
        jud_exe_per |  -.0006856   .0005415    -1.27   0.206    -.0017487    .0003776
      phy_infra_per |   .0006389   .0004359     1.47   0.143    -.0002169    .0014948
        soc_inc_per |   .0000787   .0003799     0.21   0.836    -.0006672    .0008247
     env_protec_per |  -.0006822   .0004834    -1.41   0.159    -.0016313     .000267
            fed_cop |   9.46e-06   .0002677     0.04   0.972    -.0005161     .000535
          local_cop |   .0008299   .0002628     3.16   0.002     .0003138     .001346
            ddc_cop |  -.0000171   .0001758    -0.10   0.923    -.0003622     .000328
  ln_baseline_nl_km |   .0445753   .0128204     3.48   0.001     .0194027     .069748
high_school_percent |   .0090358   .0013917     6.49   0.000     .0063032    .0117685
              _cons |   .3084723   .0587705     5.25   0.000     .1930776    .4238669
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =       9.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1786
                                                Root MSE          =     .15034

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0004735   .0007089    -0.67   0.504    -.0018655    .0009184
      org_admin_per |  -.0003792   .0005199    -0.73   0.466    -.0013999    .0006416
      budg_magm_per |   .0000153   .0005666     0.03   0.979    -.0010973    .0011278
    fiscal_magm_per |  -.0006458    .000605    -1.07   0.286    -.0018337    .0005422
    service_dev_per |    .000672   .0007224     0.93   0.353    -.0007464    .0020905
        jud_exe_per |  -.0006702   .0005395    -1.24   0.215    -.0017296    .0003892
      phy_infra_per |   .0006548   .0004366     1.50   0.134    -.0002025    .0015121
        soc_inc_per |   .0000744   .0003815     0.20   0.845    -.0006747    .0008235
     env_protec_per |  -.0007158   .0004872    -1.47   0.142    -.0016725    .0002408
            fed_cop |   .0000146   .0002674     0.05   0.956    -.0005105    .0005397
          local_cop |   .0008362   .0002646     3.16   0.002     .0003167    .0013558
            ddc_cop |  -.0000135   .0001768    -0.08   0.939    -.0003606    .0003336
  ln_baseline_nl_km |   .0452931    .013063     3.47   0.001     .0196442     .070942
high_school_percent |    .009065   .0013898     6.52   0.000     .0063362    .0117938
      ageatelection |  -.0003211   .0006265    -0.51   0.608    -.0015512     .000909
              _cons |   .3212328   .0669255     4.80   0.000     .1898256    .4526399
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =       9.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1816
                                                Root MSE          =     .15017

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0004996    .000711    -0.70   0.483    -.0018955    .0008964
      org_admin_per |  -.0003801   .0005205    -0.73   0.466    -.0014022     .000642
      budg_magm_per |   .0000787   .0005731     0.14   0.891    -.0010465    .0012039
    fiscal_magm_per |  -.0006735   .0006094    -1.11   0.269    -.0018699     .000523
    service_dev_per |    .000689    .000722     0.95   0.340    -.0007286    .0021067
        jud_exe_per |  -.0006669   .0005389    -1.24   0.216     -.001725    .0003912
      phy_infra_per |   .0006639   .0004369     1.52   0.129    -.0001938    .0015217
        soc_inc_per |   .0000278   .0003804     0.07   0.942    -.0007191    .0007746
     env_protec_per |  -.0007054   .0004854    -1.45   0.147    -.0016584    .0002477
            fed_cop |   .0000269   .0002669     0.10   0.920     -.000497    .0005509
          local_cop |   .0008236   .0002656     3.10   0.002      .000302    .0013451
            ddc_cop |  -.0000128   .0001772    -0.07   0.942    -.0003608    .0003351
  ln_baseline_nl_km |   .0460019   .0129502     3.55   0.000     .0205742    .0714295
high_school_percent |   .0089493   .0013911     6.43   0.000     .0062179    .0116807
      ageatelection |  -.0002479   .0006332    -0.39   0.695    -.0014912    .0009954
             female |   .0651388   .0497564     1.31   0.191    -.0325573     .162835
              _cons |   .3177358     .06703     4.74   0.000     .1861232    .4493485
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =       8.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1841
                                                Root MSE          =     .15006

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0004716   .0007061    -0.67   0.504     -.001858    .0009147
      org_admin_per |  -.0003778     .00052    -0.73   0.468    -.0013987    .0006432
      budg_magm_per |    .000119    .000572     0.21   0.835    -.0010042    .0012421
    fiscal_magm_per |  -.0006584   .0006082    -1.08   0.279    -.0018527    .0005359
    service_dev_per |   .0005891   .0007127     0.83   0.409    -.0008103    .0019886
        jud_exe_per |  -.0006194   .0005292    -1.17   0.242    -.0016586    .0004198
      phy_infra_per |   .0007167    .000436     1.64   0.101    -.0001393    .0015727
        soc_inc_per |   .0000445   .0003805     0.12   0.907    -.0007027    .0007917
     env_protec_per |  -.0007395   .0004875    -1.52   0.130    -.0016967    .0002176
            fed_cop |   .0000257   .0002669     0.10   0.923    -.0004982    .0005497
          local_cop |   .0008318   .0002673     3.11   0.002      .000307    .0013566
            ddc_cop |   -.000025   .0001769    -0.14   0.888    -.0003724    .0003225
  ln_baseline_nl_km |   .0451233   .0128998     3.50   0.000     .0197945     .070452
high_school_percent |   .0091263   .0014014     6.51   0.000     .0063746     .011878
      ageatelection |  -.0003709   .0006421    -0.58   0.564    -.0016317    .0008899
             female |   .0650539   .0510145     1.28   0.203    -.0351127    .1652206
     gov_coalitiion |  -.0168668    .011533    -1.46   0.144    -.0395118    .0057782
              _cons |   .3282174    .068478     4.79   0.000     .1937611    .4626736
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion ln
> _popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       9.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2128
                                                Root MSE          =     .14751

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005299   .0006998    -0.76   0.449     -.001904    .0008442
      org_admin_per |  -.0000505   .0005106    -0.10   0.921     -.001053    .0009519
      budg_magm_per |    .000121   .0005573     0.22   0.828    -.0009732    .0012153
    fiscal_magm_per |  -.0006447   .0005984    -1.08   0.282    -.0018197    .0005304
    service_dev_per |   .0006579   .0006954     0.95   0.344    -.0007075    .0020234
        jud_exe_per |  -.0008624   .0005289    -1.63   0.103    -.0019009     .000176
      phy_infra_per |   .0004235   .0004357     0.97   0.331     -.000432     .001279
        soc_inc_per |   .0000135   .0003634     0.04   0.970       -.0007     .000727
     env_protec_per |  -.0011204    .000484    -2.31   0.021    -.0020707     -.00017
            fed_cop |   .0001588   .0002647     0.60   0.549    -.0003609    .0006784
          local_cop |   .0006978    .000262     2.66   0.008     .0001833    .0012122
            ddc_cop |  -.0000112   .0001746    -0.06   0.949     -.000354    .0003317
  ln_baseline_nl_km |   .0010894   .0161401     0.07   0.946    -.0306017    .0327806
high_school_percent |    .009014   .0013871     6.50   0.000     .0062903    .0117376
      ageatelection |   -.000466   .0006208    -0.75   0.453    -.0016849     .000753
             female |   .0590243   .0505927     1.17   0.244    -.0403146    .1583631
     gov_coalitiion |  -.0174232   .0113195    -1.54   0.124     -.039649    .0048026
            ln_popn |   .0516209   .0093198     5.54   0.000     .0333215    .0699203
              _cons |  -.1586496   .1066779    -1.49   0.137    -.3681117    .0508125
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion ln
> _popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       9.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2128
                                                Root MSE          =     .14751

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005299   .0006998    -0.76   0.449     -.001904    .0008442
      org_admin_per |  -.0000505   .0005106    -0.10   0.921     -.001053    .0009519
      budg_magm_per |    .000121   .0005573     0.22   0.828    -.0009732    .0012153
    fiscal_magm_per |  -.0006447   .0005984    -1.08   0.282    -.0018197    .0005304
    service_dev_per |   .0006579   .0006954     0.95   0.344    -.0007075    .0020234
        jud_exe_per |  -.0008624   .0005289    -1.63   0.103    -.0019009     .000176
      phy_infra_per |   .0004235   .0004357     0.97   0.331     -.000432     .001279
        soc_inc_per |   .0000135   .0003634     0.04   0.970       -.0007     .000727
     env_protec_per |  -.0011204    .000484    -2.31   0.021    -.0020707     -.00017
            fed_cop |   .0001588   .0002647     0.60   0.549    -.0003609    .0006784
          local_cop |   .0006978    .000262     2.66   0.008     .0001833    .0012122
            ddc_cop |  -.0000112   .0001746    -0.06   0.949     -.000354    .0003317
  ln_baseline_nl_km |   .0010894   .0161401     0.07   0.946    -.0306017    .0327806
high_school_percent |    .009014   .0013871     6.50   0.000     .0062903    .0117376
      ageatelection |   -.000466   .0006208    -0.75   0.453    -.0016849     .000753
             female |   .0590243   .0505927     1.17   0.244    -.0403146    .1583631
     gov_coalitiion |  -.0174232   .0113195    -1.54   0.124     -.039649    .0048026
            ln_popn |   .0516209   .0093198     5.54   0.000     .0333215    .0699203
              _cons |  -.1586496   .1066779    -1.49   0.137    -.3681117    .0508125
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion ln
> _popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(19, 671)        =       8.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2175
                                                Root MSE          =     .14717

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005583   .0007008    -0.80   0.426    -.0019344    .0008177
      org_admin_per |  -.0000673   .0005038    -0.13   0.894    -.0010565    .0009219
      budg_magm_per |   .0001027   .0005601     0.18   0.855    -.0009971    .0012025
    fiscal_magm_per |  -.0007675   .0005946    -1.29   0.197    -.0019351    .0004001
    service_dev_per |   .0007514   .0006943     1.08   0.280    -.0006119    .0021147
        jud_exe_per |  -.0009678   .0005317    -1.82   0.069    -.0020119    .0000762
      phy_infra_per |   .0005016    .000435     1.15   0.249    -.0003525    .0013558
        soc_inc_per |   .0000261    .000363     0.07   0.943    -.0006866    .0007388
     env_protec_per |  -.0010644   .0004788    -2.22   0.027    -.0020046   -.0001243
            fed_cop |   .0001653   .0002629     0.63   0.530    -.0003509    .0006815
          local_cop |   .0007218   .0002601     2.77   0.006      .000211    .0012325
            ddc_cop |  -.0000474   .0001748    -0.27   0.786    -.0003906    .0002957
  ln_baseline_nl_km |  -.0034378   .0163141    -0.21   0.833    -.0354706    .0285949
high_school_percent |   .0096617   .0014808     6.52   0.000     .0067542    .0125692
      ageatelection |  -.0005054   .0006202    -0.81   0.415    -.0017233    .0007124
             female |   .0561694   .0503534     1.12   0.265    -.0426998    .1550386
     gov_coalitiion |  -.0189342   .0113616    -1.67   0.096    -.0412428    .0033744
            ln_popn |   .0639371     .01169     5.47   0.000     .0409837    .0868904
          urban_num |  -.0313949   .0169115    -1.86   0.064    -.0646007     .001811
              _cons |  -.2670107   .1266673    -2.11   0.035    -.5157228   -.0182987
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress local_cop neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       8.26
                                                Prob > F          =     0.0042
                                                R-squared         =     0.0127
                                                Root MSE          =     30.576

----------------------------------------------------------------------------------
                 |               Robust
       local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .2716404   .0945331     2.87   0.004     .0860329    .4572479
           _cons |   27.92648   1.881371    14.84   0.000     24.23258    31.62039
----------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, replace dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =      59.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4708
                                                Root MSE          =     22.567

----------------------------------------------------------------------------------
                 |               Robust
       local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |    .065454   .0700008     0.94   0.350    -.0719905    .2028984
    gov_magm_per |  -.0794329   .0920496    -0.86   0.388    -.2601695    .1013037
   org_admin_per |   -.088569   .0748536    -1.18   0.237    -.2355418    .0584038
   budg_magm_per |   .1287728   .0850565     1.51   0.131    -.0382331    .2957787
 fiscal_magm_per |   .0561618   .0896943     0.63   0.531    -.1199503    .2322738
 service_dev_per |    .138205   .1024471     1.35   0.178    -.0629467    .3393567
     jud_exe_per |   .0543457   .0660594     0.82   0.411    -.0753598    .1840512
   phy_infra_per |   .2100863   .0690831     3.04   0.002     .0744438    .3457288
     soc_inc_per |  -.0967195   .0616324    -1.57   0.117    -.2177328    .0242938
  env_protec_per |   .3259029   .0806531     4.04   0.000     .1675431    .4842627
         fed_cop |   .3834232   .0392482     9.77   0.000     .3063606    .4604859
         ddc_cop |   .1476654   .0280388     5.27   0.000     .0926122    .2027187
           _cons |  -19.21951    5.68379    -3.38   0.001    -30.37946   -8.059567
----------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =      57.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4770
                                                Root MSE          =     22.451

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |    .034083   .0697911     0.49   0.625    -.1029501    .1711161
       gov_magm_per |  -.0859512   .0926455    -0.93   0.354    -.2678582    .0959558
      org_admin_per |  -.0637366   .0745319    -0.86   0.393    -.2100782    .0826049
      budg_magm_per |   .1219939   .0843939     1.45   0.149    -.0437114    .2876992
    fiscal_magm_per |   .0661991   .0896256     0.74   0.460    -.1097784    .2421766
    service_dev_per |   .1274949   .1019357     1.25   0.211    -.0726532     .327643
        jud_exe_per |   .0294651   .0659043     0.45   0.655    -.0999363    .1588664
      phy_infra_per |   .1966342   .0685659     2.87   0.004     .0620068    .3312617
        soc_inc_per |  -.0994784   .0609829    -1.63   0.103    -.2192168      .02026
     env_protec_per |   .2877908   .0810036     3.55   0.000     .1287424    .4468392
            fed_cop |   .3810304   .0389709     9.78   0.000      .304512    .4575488
            ddc_cop |    .149447   .0278514     5.37   0.000     .0947616    .2041325
high_school_percent |   .5254111   .1766864     2.97   0.003     .1784919    .8723302
              _cons |  -20.92088   5.730821    -3.65   0.000     -32.1732   -9.668557
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =      53.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4787
                                                Root MSE          =     22.431

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0284671   .0697969     0.41   0.684    -.1085777    .1655118
       gov_magm_per |  -.0961329   .0922687    -1.04   0.298    -.2773007    .0850348
      org_admin_per |  -.0603554   .0746099    -0.81   0.419    -.2068505    .0861396
      budg_magm_per |   .1198686   .0843539     1.42   0.156    -.0457586    .2854957
    fiscal_magm_per |   .0717729   .0897865     0.80   0.424    -.1045211    .2480669
    service_dev_per |    .124316   .1021192     1.22   0.224    -.0761928    .3248249
        jud_exe_per |   .0249898   .0660069     0.38   0.705    -.1046134    .1545931
      phy_infra_per |   .1879963    .068977     2.73   0.007     .0525613    .3234314
        soc_inc_per |  -.0959982   .0610031    -1.57   0.116    -.2157766    .0237802
     env_protec_per |   .3003775    .082324     3.65   0.000      .138736     .462019
            fed_cop |   .3779492   .0389387     9.71   0.000     .3014938    .4544045
            ddc_cop |    .147505   .0279691     5.27   0.000     .0925882    .2024218
high_school_percent |   .4997735   .1783302     2.80   0.005     .1496258    .8499213
      ageatelection |   .1399521   .0920915     1.52   0.129    -.0408677    .3207719
              _cons |   -26.6285   6.685484    -3.98   0.000    -39.75531   -13.50169
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =      50.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4791
                                                Root MSE          =     22.438

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0295815   .0698791     0.42   0.672    -.1076252    .1667881
       gov_magm_per |  -.0981604   .0924787    -1.06   0.289    -.2797409      .08342
      org_admin_per |    -.06038   .0745128    -0.81   0.418    -.2066848    .0859248
      budg_magm_per |   .1244818   .0845326     1.47   0.141    -.0414967    .2904602
    fiscal_magm_per |   .0693461   .0899291     0.77   0.441    -.1072284    .2459206
    service_dev_per |   .1254402   .1021753     1.23   0.220    -.0751795      .32606
        jud_exe_per |   .0248155   .0660376     0.38   0.707    -.1048484    .1544793
      phy_infra_per |   .1886203   .0689073     2.74   0.006     .0533219    .3239188
        soc_inc_per |  -.0993602    .061412    -1.62   0.106    -.2199417    .0212213
     env_protec_per |   .3010792   .0821824     3.66   0.000     .1397153    .4624431
            fed_cop |   .3784327   .0389731     9.71   0.000     .3019097    .4549558
            ddc_cop |   .1474053   .0280231     5.26   0.000     .0923823    .2024282
high_school_percent |   .4929473    .178576     2.76   0.006     .1423162    .8435785
      ageatelection |    .145163   .0923644     1.57   0.117    -.0361931    .3265192
             female |   4.514021   5.292378     0.85   0.394    -5.877482    14.90552
              _cons |  -26.82642   6.687996    -4.01   0.000    -39.95819   -13.69464
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop high_school_percent ageatelection female ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =      49.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4883
                                                Root MSE          =     22.255

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0583843    .070871     0.82   0.410    -.0807702    .1975388
       gov_magm_per |  -.0933455   .0919653    -1.02   0.310    -.2739184    .0872275
      org_admin_per |  -.0333372   .0758817    -0.44   0.661    -.1823301    .1156556
      budg_magm_per |    .110335   .0840427     1.31   0.190    -.0546821     .275352
    fiscal_magm_per |   .0971941   .0900368     1.08   0.281    -.0795922    .2739803
    service_dev_per |   .1298389   .1008417     1.29   0.198    -.0681628    .3278405
        jud_exe_per |   .0275651   .0653242     0.42   0.673    -.1006984    .1558286
      phy_infra_per |   .1475683   .0682018     2.16   0.031     .0136548    .2814818
        soc_inc_per |  -.0902729   .0611805    -1.48   0.141    -.2104002    .0298544
     env_protec_per |   .2530614    .082383     3.07   0.002     .0913032    .4148195
            fed_cop |   .3893789   .0391057     9.96   0.000     .3125954    .4661625
            ddc_cop |   .1466832   .0279161     5.25   0.000     .0918702    .2014962
high_school_percent |   .3080532   .1881319     1.64   0.102    -.0613419    .6774483
      ageatelection |   .1085295    .094029     1.15   0.249    -.0760956    .2931545
             female |   4.502375   5.002151     0.90   0.368    -5.319298    14.32405
            ln_popn |   4.296605   1.331999     3.23   0.001     1.681239     6.91197
              _cons |  -68.42237   13.80129    -4.96   0.000    -95.52107   -41.32366
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop high_school_percent ageatelection female ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =      46.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4893
                                                Root MSE          =      22.25

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |    .053051   .0711325     0.75   0.456    -.0866172    .1927193
       gov_magm_per |  -.0908637   .0923089    -0.98   0.325    -.2721118    .0903845
      org_admin_per |  -.0307207   .0758007    -0.41   0.685    -.1795551    .1181136
      budg_magm_per |   .1124167   .0838701     1.34   0.181    -.0522618    .2770952
    fiscal_magm_per |   .1057795   .0908147     1.16   0.245    -.0725346    .2840937
    service_dev_per |   .1210887   .1021073     1.19   0.236    -.0793985    .3215759
        jud_exe_per |   .0345522   .0655242     0.53   0.598    -.0941043    .1632087
      phy_infra_per |   .1411736   .0684082     2.06   0.039     .0068544    .2754927
        soc_inc_per |  -.0916181   .0613368    -1.49   0.136    -.2120526    .0288163
     env_protec_per |   .2470592   .0828088     2.98   0.003     .0844645     .409654
            fed_cop |   .3880157   .0391144     9.92   0.000     .3112148    .4648167
            ddc_cop |   .1493808   .0280754     5.32   0.000     .0942549    .2045067
high_school_percent |   .2664227     .18945     1.41   0.160    -.1055615     .638407
      ageatelection |   .1123757   .0941527     1.19   0.233    -.0724927     .297244
             female |   4.670075   5.017826     0.93   0.352    -5.182401    14.52255
            ln_popn |   3.415685   1.552848     2.20   0.028      .366675    6.464695
          urban_num |   2.626003   2.337179     1.12   0.262    -1.963035    7.215042
              _cons |  -60.54327   15.47474    -3.91   0.000    -90.92785    -30.1587
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress local_cop neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       8.26
                                                Prob > F          =     0.0042
                                                R-squared         =     0.0127
                                                Root MSE          =     30.576

----------------------------------------------------------------------------------
                 |               Robust
       local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .2716404   .0945331     2.87   0.004     .0860329    .4572479
           _cons |   27.92648   1.881371    14.84   0.000     24.23258    31.62039
----------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, replace dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(2, 688)         =      28.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0815
                                                Root MSE          =     29.513

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1423194    .090909     1.57   0.118     -.036173    .3208119
high_school_percent |   1.618791   .2328552     6.95   0.000     1.161599    2.075983
              _cons |   13.59103    2.64779     5.13   0.000     8.392312    18.78975
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(3, 687)         =      22.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1009
                                                Root MSE          =     29.221

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1825309   .0925541     1.97   0.049      .000808    .3642538
high_school_percent |   1.287932   .2441556     5.28   0.000     .8085509    1.767312
            ln_popn |   5.871562   1.593604     3.68   0.000     2.742643    9.000481
              _cons |  -43.78757    15.9128    -2.75   0.006    -75.03113   -12.54401
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(4, 686)         =      17.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1025
                                                Root MSE          =     29.217

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1767311   .0925811     1.91   0.057    -.0050452    .3585073
high_school_percent |   1.234445   .2509894     4.92   0.000     .7416456    1.727245
            ln_popn |   4.731611   1.887557     2.51   0.012      1.02553    8.437693
          urban_num |   3.234906   3.023877     1.07   0.285    -2.702259    9.172071
              _cons |  -32.75622   18.73338    -1.75   0.081    -69.53786    4.025414
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(5, 685)         =      15.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1088
                                                Root MSE          =     29.135

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1600276   .0933913     1.71   0.087    -.0233401    .3433952
high_school_percent |   1.193161   .2511441     4.75   0.000     .7000563    1.686265
            ln_popn |   4.263404   1.891554     2.25   0.025     .5494646    7.977344
          urban_num |   3.524042   3.007714     1.17   0.242    -2.381404    9.429488
      ageatelection |   .2645701   .1256351     2.11   0.036      .017894    .5112462
              _cons |  -40.20629   19.03704    -2.11   0.035    -77.58424   -2.828335
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(6, 684)         =      13.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1093
                                                Root MSE          =     29.148

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1605784   .0934513     1.72   0.086    -.0229074    .3440643
high_school_percent |   1.184151     .25203     4.70   0.000     .6893054    1.678996
            ln_popn |   4.256765    1.88986     2.25   0.025     .5461415    7.967388
          urban_num |   3.572107   3.003922     1.19   0.235    -2.325908    9.470121
      ageatelection |    .270528   .1259382     2.15   0.032     .0232561    .5177998
             female |   4.948424   8.290264     0.60   0.551      -11.329    21.22584
              _cons |  -40.46371   19.04782    -2.12   0.034    -77.86293   -3.064498
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admin_per bu
> dg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =      46.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4893
                                                Root MSE          =      22.25

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |    .053051   .0711325     0.75   0.456    -.0866172    .1927193
high_school_percent |   .2664227     .18945     1.41   0.160    -.1055615     .638407
            ln_popn |   3.415685   1.552848     2.20   0.028      .366675    6.464695
          urban_num |   2.626003   2.337179     1.12   0.262    -1.963035    7.215042
      ageatelection |   .1123757   .0941527     1.19   0.233    -.0724927     .297244
             female |   4.670075   5.017826     0.93   0.352    -5.182401    14.52255
       gov_magm_per |  -.0908637   .0923089    -0.98   0.325    -.2721118    .0903845
      org_admin_per |  -.0307207   .0758007    -0.41   0.685    -.1795551    .1181136
      budg_magm_per |   .1124167   .0838701     1.34   0.181    -.0522618    .2770952
    fiscal_magm_per |   .1057795   .0908147     1.16   0.245    -.0725346    .2840937
    service_dev_per |   .1210887   .1021073     1.19   0.236    -.0793985    .3215759
        jud_exe_per |   .0345522   .0655242     0.53   0.598    -.0941043    .1632087
      phy_infra_per |   .1411736   .0684082     2.06   0.039     .0068544    .2754927
        soc_inc_per |  -.0916181   .0613368    -1.49   0.136    -.2120526    .0288163
     env_protec_per |   .2470592   .0828088     2.98   0.003     .0844645     .409654
            fed_cop |   .3880157   .0391144     9.92   0.000     .3112148    .4648167
            ddc_cop |   .1493808   .0280754     5.32   0.000     .0942549    .2045067
              _cons |  -60.54327   15.47474    -3.91   0.000    -90.92785    -30.1587
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress local_cop neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       8.26
                                                Prob > F          =     0.0042
                                                R-squared         =     0.0127
                                                Root MSE          =     30.576

----------------------------------------------------------------------------------
                 |               Robust
       local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .2716404   .0945331     2.87   0.004     .0860329    .4572479
           _cons |   27.92648   1.881371    14.84   0.000     24.23258    31.62039
----------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, replace dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(2, 688)         =      28.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0815
                                                Root MSE          =     29.513

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1423194    .090909     1.57   0.118     -.036173    .3208119
high_school_percent |   1.618791   .2328552     6.95   0.000     1.161599    2.075983
              _cons |   13.59103    2.64779     5.13   0.000     8.392312    18.78975
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(3, 687)         =      22.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1009
                                                Root MSE          =     29.221

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1825309   .0925541     1.97   0.049      .000808    .3642538
high_school_percent |   1.287932   .2441556     5.28   0.000     .8085509    1.767312
            ln_popn |   5.871562   1.593604     3.68   0.000     2.742643    9.000481
              _cons |  -43.78757    15.9128    -2.75   0.006    -75.03113   -12.54401
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(4, 686)         =      17.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1025
                                                Root MSE          =     29.217

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1767311   .0925811     1.91   0.057    -.0050452    .3585073
high_school_percent |   1.234445   .2509894     4.92   0.000     .7416456    1.727245
            ln_popn |   4.731611   1.887557     2.51   0.012      1.02553    8.437693
          urban_num |   3.234906   3.023877     1.07   0.285    -2.702259    9.172071
              _cons |  -32.75622   18.73338    -1.75   0.081    -69.53786    4.025414
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(5, 685)         =      15.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1088
                                                Root MSE          =     29.135

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1600276   .0933913     1.71   0.087    -.0233401    .3433952
high_school_percent |   1.193161   .2511441     4.75   0.000     .7000563    1.686265
            ln_popn |   4.263404   1.891554     2.25   0.025     .5494646    7.977344
          urban_num |   3.524042   3.007714     1.17   0.242    -2.381404    9.429488
      ageatelection |   .2645701   .1256351     2.11   0.036      .017894    .5112462
              _cons |  -40.20629   19.03704    -2.11   0.035    -77.58424   -2.828335
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(6, 684)         =      13.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1093
                                                Root MSE          =     29.148

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1605784   .0934513     1.72   0.086    -.0229074    .3440643
high_school_percent |   1.184151     .25203     4.70   0.000     .6893054    1.678996
            ln_popn |   4.256765    1.88986     2.25   0.025     .5461415    7.967388
          urban_num |   3.572107   3.003922     1.19   0.235    -2.325908    9.470121
      ageatelection |    .270528   .1259382     2.15   0.032     .0232561    .5177998
             female |   4.948424   8.290264     0.60   0.551      -11.329    21.22584
              _cons |  -40.46371   19.04782    -2.12   0.034    -77.86293   -3.064498
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admin_per bu
> dg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =      27.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3379
                                                Root MSE          =     25.298

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0471587   .0820061     0.58   0.565     -.113859    .2081765
high_school_percent |   .3376843   .2271602     1.49   0.138    -.1083414    .7837099
            ln_popn |   2.361567   1.654352     1.43   0.154    -.8867267    5.609861
          urban_num |   1.701347   2.655963     0.64   0.522    -3.513596    6.916291
      ageatelection |   .2355786   .1084093     2.17   0.030     .0227185    .4484387
             female |   3.419645   6.855979     0.50   0.618    -10.04196    16.88125
       gov_magm_per |   .0685007   .1034031     0.66   0.508    -.1345298    .2715312
      org_admin_per |  -.0001014   .0839321    -0.00   0.999    -.1649008     .164698
      budg_magm_per |   .0551657   .0983858     0.56   0.575    -.1380134    .2483448
    fiscal_magm_per |   .1663015   .1022272     1.63   0.104      -.03442     .367023
    service_dev_per |   .1076419   .1126124     0.96   0.339    -.1134707    .3287546
        jud_exe_per |   .0670716   .0743632     0.90   0.367    -.0789394    .2130825
      phy_infra_per |   .2654826   .0797484     3.33   0.001     .1088979    .4220674
        soc_inc_per |   .0502472   .0661405     0.76   0.448    -.0796186     .180113
     env_protec_per |   .4430052   .0944505     4.69   0.000     .2575531    .6284573
              _cons |  -74.17046   17.29388    -4.29   0.000    -108.1267    -40.2142
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admin_per bu
> dg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =      46.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4893
                                                Root MSE          =      22.25

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |    .053051   .0711325     0.75   0.456    -.0866172    .1927193
high_school_percent |   .2664227     .18945     1.41   0.160    -.1055615     .638407
            ln_popn |   3.415685   1.552848     2.20   0.028      .366675    6.464695
          urban_num |   2.626003   2.337179     1.12   0.262    -1.963035    7.215042
      ageatelection |   .1123757   .0941527     1.19   0.233    -.0724927     .297244
             female |   4.670075   5.017826     0.93   0.352    -5.182401    14.52255
       gov_magm_per |  -.0908637   .0923089    -0.98   0.325    -.2721118    .0903845
      org_admin_per |  -.0307207   .0758007    -0.41   0.685    -.1795551    .1181136
      budg_magm_per |   .1124167   .0838701     1.34   0.181    -.0522618    .2770952
    fiscal_magm_per |   .1057795   .0908147     1.16   0.245    -.0725346    .2840937
    service_dev_per |   .1210887   .1021073     1.19   0.236    -.0793985    .3215759
        jud_exe_per |   .0345522   .0655242     0.53   0.598    -.0941043    .1632087
      phy_infra_per |   .1411736   .0684082     2.06   0.039     .0068544    .2754927
        soc_inc_per |  -.0916181   .0613368    -1.49   0.136    -.2120526    .0288163
     env_protec_per |   .2470592   .0828088     2.98   0.003     .0844645     .409654
            fed_cop |   .3880157   .0391144     9.92   0.000     .3112148    .4648167
            ddc_cop |   .1493808   .0280754     5.32   0.000     .0942549    .2045067
              _cons |  -60.54327   15.47474    -3.91   0.000    -90.92785    -30.1587
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress rel_chgnl neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       4.32
                                                Prob > F          =     0.0380
                                                R-squared         =     0.0065
                                                Root MSE          =     .16365

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .0010373   .0004989     2.08   0.038     .0000577     .002017
           _cons |   .3211642   .0098258    32.69   0.000     .3018722    .3404562
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =       2.81
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0431
                                                Root MSE          =     .16191

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |    .000945   .0005334     1.77   0.077    -.0001023    .0019923
    gov_magm_per |  -.0005903   .0007551    -0.78   0.435    -.0020729    .0008923
   org_admin_per |  -.0009673   .0005492    -1.76   0.079    -.0020455     .000111
   budg_magm_per |   .0004858    .000618     0.79   0.432    -.0007277    .0016994
 fiscal_magm_per |  -.0011784   .0006588    -1.79   0.074    -.0024719     .000115
 service_dev_per |   .0010337   .0007639     1.35   0.176    -.0004661    .0025336
     jud_exe_per |  -.0004248   .0005756    -0.74   0.461     -.001555    .0007054
   phy_infra_per |   .0012733   .0004631     2.75   0.006      .000364    .0021826
     soc_inc_per |  -.0001109      .0004    -0.28   0.782    -.0008962    .0006744
  env_protec_per |   .0005365   .0005242     1.02   0.306    -.0004928    .0015658
         fed_cop |   .0003407   .0002588     1.32   0.188    -.0001674    .0008489
         ddc_cop |   .0000687   .0001874     0.37   0.714    -.0002994    .0004367
           _cons |   .3573428   .0613452     5.83   0.000     .2368933    .4777923
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =       5.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1173
                                                Root MSE          =     .15562

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
 neighbor_percent |   .0014727   .0005382     2.74   0.006      .000416    .0025295
     gov_magm_per |   -.000503   .0007249    -0.69   0.488    -.0019263    .0009203
    org_admin_per |  -.0007852   .0005246    -1.50   0.135    -.0018152    .0002448
    budg_magm_per |   .0001362   .0005993     0.23   0.820    -.0010404    .0013129
  fiscal_magm_per |  -.0004558   .0006363    -0.72   0.474    -.0017051    .0007935
  service_dev_per |   .0009351   .0007428     1.26   0.209    -.0005235    .0023936
      jud_exe_per |  -.0001118   .0005571    -0.20   0.841    -.0012057    .0009821
    phy_infra_per |   .0008021   .0004469     1.79   0.073    -.0000754    .0016795
      soc_inc_per |   .0001265   .0003902     0.32   0.746    -.0006397    .0008927
   env_protec_per |   .0000152   .0005129     0.03   0.976    -.0009919    .0010222
          fed_cop |   .0004011   .0002515     1.59   0.111    -.0000927    .0008948
          ddc_cop |   .0000661   .0001801     0.37   0.714    -.0002874    .0004196
ln_baseline_nl_km |    .082628   .0138488     5.97   0.000     .0554362    .1098197
            _cons |   .2887565   .0590414     4.89   0.000     .1728302    .4046828
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =       8.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1687
                                                Root MSE          =     .15114

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007464   .0005556     1.34   0.180    -.0003444    .0018373
       gov_magm_per |  -.0006455   .0007208    -0.90   0.371    -.0020608    .0007697
      org_admin_per |  -.0004351   .0005108    -0.85   0.395     -.001438    .0005678
      budg_magm_per |   .0001531   .0005806     0.26   0.792     -.000987    .0012932
    fiscal_magm_per |  -.0005575   .0006159    -0.91   0.366    -.0017669    .0006518
    service_dev_per |   .0007916   .0007227     1.10   0.274    -.0006274    .0022106
        jud_exe_per |  -.0006483   .0005436    -1.19   0.233    -.0017156    .0004191
      phy_infra_per |   .0007521   .0004351     1.73   0.084    -.0001022    .0016063
        soc_inc_per |  -8.96e-06    .000378    -0.02   0.981    -.0007511    .0007332
     env_protec_per |  -.0004315   .0004971    -0.87   0.386    -.0014075    .0005445
            fed_cop |   .0003381   .0002447     1.38   0.168    -.0001424    .0008187
            ddc_cop |   .0000971   .0001778     0.55   0.585     -.000252    .0004462
  ln_baseline_nl_km |   .0516579   .0137315     3.76   0.000     .0246963    .0786194
high_school_percent |   .0088515   .0014399     6.15   0.000     .0060244    .0116787
              _cons |   .2858009   .0576037     4.96   0.000     .1726973    .3989045
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =       8.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1690
                                                Root MSE          =     .15122

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007665   .0005615     1.37   0.173     -.000336     .001869
       gov_magm_per |  -.0006217   .0007186    -0.87   0.387    -.0020327    .0007893
      org_admin_per |  -.0004426   .0005101    -0.87   0.386    -.0014443     .000559
      budg_magm_per |   .0001548   .0005815     0.27   0.790    -.0009869    .0012965
    fiscal_magm_per |  -.0005634   .0006163    -0.91   0.361    -.0017736    .0006468
    service_dev_per |   .0007985   .0007233     1.10   0.270    -.0006218    .0022187
        jud_exe_per |  -.0006334   .0005413    -1.17   0.242    -.0016962    .0004294
      phy_infra_per |   .0007675   .0004366     1.76   0.079    -.0000897    .0016247
        soc_inc_per |  -.0000141   .0003798    -0.04   0.970    -.0007598    .0007316
     env_protec_per |  -.0004616   .0005001    -0.92   0.356    -.0014436    .0005203
            fed_cop |   .0003457    .000245     1.41   0.159    -.0001353    .0008268
            ddc_cop |   .0001012   .0001791     0.57   0.572    -.0002505    .0004529
  ln_baseline_nl_km |   .0524815   .0140999     3.72   0.000     .0247965    .0801664
high_school_percent |   .0088685   .0014378     6.17   0.000     .0060455    .0116916
      ageatelection |  -.0003093   .0006352    -0.49   0.626    -.0015566     .000938
              _cons |     .29786   .0659838     4.51   0.000     .1683019    .4274182
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =       8.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1726
                                                Root MSE          =       .151

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007925   .0005563     1.42   0.155    -.0002998    .0018848
       gov_magm_per |  -.0006517   .0007205    -0.90   0.366    -.0020665     .000763
      org_admin_per |  -.0004432   .0005105    -0.87   0.386    -.0014456    .0005591
      budg_magm_per |   .0002246   .0005882     0.38   0.703    -.0009303    .0013795
    fiscal_magm_per |  -.0005951   .0006204    -0.96   0.338    -.0018133     .000623
    service_dev_per |   .0008162    .000722     1.13   0.259    -.0006015    .0022339
        jud_exe_per |  -.0006306   .0005406    -1.17   0.244     -.001692    .0004308
      phy_infra_per |   .0007738   .0004369     1.77   0.077    -.0000839    .0016316
        soc_inc_per |  -.0000646   .0003785    -0.17   0.865    -.0008079    .0006787
     env_protec_per |  -.0004536   .0004979    -0.91   0.363    -.0014312    .0005239
            fed_cop |   .0003544   .0002439     1.45   0.147    -.0001246    .0008333
            ddc_cop |   .0000996   .0001797     0.55   0.580    -.0002532    .0004524
  ln_baseline_nl_km |   .0533613   .0139233     3.83   0.000      .026023    .0806997
high_school_percent |   .0087196   .0014339     6.08   0.000     .0059041     .011535
      ageatelection |  -.0002338    .000642    -0.36   0.716    -.0014944    .0010267
             female |    .071305   .0499696     1.43   0.154    -.0268098    .1694198
              _cons |   .2944198   .0660265     4.46   0.000     .1647776    .4240621
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =       8.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1754
                                                Root MSE          =     .15085

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008685   .0005694     1.53   0.128    -.0002494    .0019865
       gov_magm_per |  -.0006303   .0007154    -0.88   0.379     -.002035    .0007744
      org_admin_per |  -.0004426   .0005093    -0.87   0.385    -.0014425    .0005574
      budg_magm_per |   .0002747   .0005883     0.47   0.641    -.0008804    .0014299
    fiscal_magm_per |  -.0005781   .0006192    -0.93   0.351    -.0017939    .0006376
    service_dev_per |   .0007116   .0007124     1.00   0.318    -.0006871    .0021103
        jud_exe_per |  -.0005791   .0005297    -1.09   0.275    -.0016192     .000461
      phy_infra_per |   .0008291   .0004361     1.90   0.058    -.0000271    .0016853
        soc_inc_per |  -.0000492   .0003787    -0.13   0.897    -.0007929    .0006944
     env_protec_per |  -.0004865   .0004981    -0.98   0.329    -.0014646    .0004915
            fed_cop |   .0003577    .000244     1.47   0.143    -.0001214    .0008368
            ddc_cop |   .0000868   .0001796     0.48   0.629    -.0002657    .0004394
  ln_baseline_nl_km |   .0528801   .0138319     3.82   0.000     .0257212    .0800389
high_school_percent |   .0088639   .0014345     6.18   0.000     .0060474    .0116805
      ageatelection |  -.0003743   .0006552    -0.57   0.568    -.0016609    .0009122
             female |   .0714609   .0513932     1.39   0.165    -.0294494    .1723712
     gov_coalitiion |  -.0182638   .0119828    -1.52   0.128     -.041792    .0052643
              _cons |    .305508    .067573     4.52   0.000     .1728287    .4381873
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       8.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2072
                                                Root MSE          =     .14803

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007805   .0005732     1.36   0.174     -.000345     .001906
       gov_magm_per |  -.0006704   .0007093    -0.95   0.345    -.0020632    .0007223
      org_admin_per |  -.0000901   .0005031    -0.18   0.858    -.0010779    .0008977
      budg_magm_per |   .0002552   .0005695     0.45   0.654    -.0008631    .0013735
    fiscal_magm_per |  -.0005773    .000609    -0.95   0.344    -.0017731    .0006185
    service_dev_per |   .0007639   .0006957     1.10   0.273    -.0006021    .0021299
        jud_exe_per |  -.0008401   .0005292    -1.59   0.113    -.0018792    .0001991
      phy_infra_per |   .0005011   .0004365     1.15   0.251    -.0003558    .0013581
        soc_inc_per |  -.0000673   .0003618    -0.19   0.853    -.0007775     .000643
     env_protec_per |   -.000927   .0004908    -1.89   0.059    -.0018907    .0000367
            fed_cop |    .000442   .0002402     1.84   0.066    -.0000296    .0009135
            ddc_cop |   .0000816   .0001765     0.46   0.644    -.0002649    .0004282
  ln_baseline_nl_km |   .0058137   .0169914     0.34   0.732    -.0275489    .0391762
high_school_percent |   .0087534   .0014206     6.16   0.000      .005964    .0115428
      ageatelection |  -.0004808   .0006326    -0.76   0.447     -.001723    .0007613
             female |   .0642259   .0505857     1.27   0.205    -.0350991     .163551
     gov_coalitiion |  -.0187631   .0117716    -1.59   0.111    -.0418767    .0043504
            ln_popn |   .0540301   .0094489     5.72   0.000     .0354773     .072583
              _cons |  -.2001673   .1069272    -1.87   0.062     -.410119    .0097843
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(19, 671)        =       8.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2117
                                                Root MSE          =     .14772

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008216   .0005731     1.43   0.152    -.0003038    .0019469
       gov_magm_per |  -.0007043     .00071    -0.99   0.322    -.0020984    .0006898
      org_admin_per |  -.0001081   .0004966    -0.22   0.828    -.0010832    .0008671
      budg_magm_per |   .0002431   .0005724     0.42   0.671    -.0008808    .0013669
    fiscal_magm_per |  -.0006946   .0006052    -1.15   0.252    -.0018829    .0004937
    service_dev_per |   .0008586   .0006961     1.23   0.218    -.0005082    .0022255
        jud_exe_per |  -.0009418   .0005332    -1.77   0.078    -.0019887    .0001051
      phy_infra_per |   .0005793   .0004358     1.33   0.184    -.0002765    .0014351
        soc_inc_per |  -.0000581   .0003612    -0.16   0.872    -.0007674    .0006512
     env_protec_per |  -.0008658   .0004853    -1.78   0.075    -.0018187    .0000871
            fed_cop |    .000458   .0002394     1.91   0.056     -.000012    .0009281
            ddc_cop |   .0000492   .0001768     0.28   0.781    -.0002978    .0003963
  ln_baseline_nl_km |   .0016619   .0171199     0.10   0.923    -.0319532    .0352769
high_school_percent |   .0093654   .0015077     6.21   0.000     .0064051    .0123257
      ageatelection |  -.0005216   .0006318    -0.83   0.409    -.0017623     .000719
             female |    .061664   .0503927     1.22   0.222    -.0372824    .1606103
     gov_coalitiion |   -.020317    .011815    -1.72   0.086    -.0435158    .0028818
            ln_popn |   .0660817   .0119268     5.54   0.000     .0426633    .0895001
          urban_num |  -.0305451   .0170186    -1.79   0.073    -.0639613    .0028711
              _cons |  -.3068519   .1282078    -2.39   0.017    -.5585887   -.0551151
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress rel_chgnl neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       4.32
                                                Prob > F          =     0.0380
                                                R-squared         =     0.0065
                                                Root MSE          =     .16365

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .0010373   .0004989     2.08   0.038     .0000577     .002017
           _cons |   .3211642   .0098258    32.69   0.000     .3018722    .3404562
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =       2.81
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0431
                                                Root MSE          =     .16191

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |    .000945   .0005334     1.77   0.077    -.0001023    .0019923
    gov_magm_per |  -.0005903   .0007551    -0.78   0.435    -.0020729    .0008923
   org_admin_per |  -.0009673   .0005492    -1.76   0.079    -.0020455     .000111
   budg_magm_per |   .0004858    .000618     0.79   0.432    -.0007277    .0016994
 fiscal_magm_per |  -.0011784   .0006588    -1.79   0.074    -.0024719     .000115
 service_dev_per |   .0010337   .0007639     1.35   0.176    -.0004661    .0025336
     jud_exe_per |  -.0004248   .0005756    -0.74   0.461     -.001555    .0007054
   phy_infra_per |   .0012733   .0004631     2.75   0.006      .000364    .0021826
     soc_inc_per |  -.0001109      .0004    -0.28   0.782    -.0008962    .0006744
  env_protec_per |   .0005365   .0005242     1.02   0.306    -.0004928    .0015658
         fed_cop |   .0003407   .0002588     1.32   0.188    -.0001674    .0008489
         ddc_cop |   .0000687   .0001874     0.37   0.714    -.0002994    .0004367
           _cons |   .3573428   .0613452     5.83   0.000     .2368933    .4777923
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =       5.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1173
                                                Root MSE          =     .15562

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
 neighbor_percent |   .0014727   .0005382     2.74   0.006      .000416    .0025295
     gov_magm_per |   -.000503   .0007249    -0.69   0.488    -.0019263    .0009203
    org_admin_per |  -.0007852   .0005246    -1.50   0.135    -.0018152    .0002448
    budg_magm_per |   .0001362   .0005993     0.23   0.820    -.0010404    .0013129
  fiscal_magm_per |  -.0004558   .0006363    -0.72   0.474    -.0017051    .0007935
  service_dev_per |   .0009351   .0007428     1.26   0.209    -.0005235    .0023936
      jud_exe_per |  -.0001118   .0005571    -0.20   0.841    -.0012057    .0009821
    phy_infra_per |   .0008021   .0004469     1.79   0.073    -.0000754    .0016795
      soc_inc_per |   .0001265   .0003902     0.32   0.746    -.0006397    .0008927
   env_protec_per |   .0000152   .0005129     0.03   0.976    -.0009919    .0010222
          fed_cop |   .0004011   .0002515     1.59   0.111    -.0000927    .0008948
          ddc_cop |   .0000661   .0001801     0.37   0.714    -.0002874    .0004196
ln_baseline_nl_km |    .082628   .0138488     5.97   0.000     .0554362    .1098197
            _cons |   .2887565   .0590414     4.89   0.000     .1728302    .4046828
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =       8.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1687
                                                Root MSE          =     .15114

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007464   .0005556     1.34   0.180    -.0003444    .0018373
       gov_magm_per |  -.0006455   .0007208    -0.90   0.371    -.0020608    .0007697
      org_admin_per |  -.0004351   .0005108    -0.85   0.395     -.001438    .0005678
      budg_magm_per |   .0001531   .0005806     0.26   0.792     -.000987    .0012932
    fiscal_magm_per |  -.0005575   .0006159    -0.91   0.366    -.0017669    .0006518
    service_dev_per |   .0007916   .0007227     1.10   0.274    -.0006274    .0022106
        jud_exe_per |  -.0006483   .0005436    -1.19   0.233    -.0017156    .0004191
      phy_infra_per |   .0007521   .0004351     1.73   0.084    -.0001022    .0016063
        soc_inc_per |  -8.96e-06    .000378    -0.02   0.981    -.0007511    .0007332
     env_protec_per |  -.0004315   .0004971    -0.87   0.386    -.0014075    .0005445
            fed_cop |   .0003381   .0002447     1.38   0.168    -.0001424    .0008187
            ddc_cop |   .0000971   .0001778     0.55   0.585     -.000252    .0004462
  ln_baseline_nl_km |   .0516579   .0137315     3.76   0.000     .0246963    .0786194
high_school_percent |   .0088515   .0014399     6.15   0.000     .0060244    .0116787
              _cons |   .2858009   .0576037     4.96   0.000     .1726973    .3989045
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =       8.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1690
                                                Root MSE          =     .15122

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007665   .0005615     1.37   0.173     -.000336     .001869
       gov_magm_per |  -.0006217   .0007186    -0.87   0.387    -.0020327    .0007893
      org_admin_per |  -.0004426   .0005101    -0.87   0.386    -.0014443     .000559
      budg_magm_per |   .0001548   .0005815     0.27   0.790    -.0009869    .0012965
    fiscal_magm_per |  -.0005634   .0006163    -0.91   0.361    -.0017736    .0006468
    service_dev_per |   .0007985   .0007233     1.10   0.270    -.0006218    .0022187
        jud_exe_per |  -.0006334   .0005413    -1.17   0.242    -.0016962    .0004294
      phy_infra_per |   .0007675   .0004366     1.76   0.079    -.0000897    .0016247
        soc_inc_per |  -.0000141   .0003798    -0.04   0.970    -.0007598    .0007316
     env_protec_per |  -.0004616   .0005001    -0.92   0.356    -.0014436    .0005203
            fed_cop |   .0003457    .000245     1.41   0.159    -.0001353    .0008268
            ddc_cop |   .0001012   .0001791     0.57   0.572    -.0002505    .0004529
  ln_baseline_nl_km |   .0524815   .0140999     3.72   0.000     .0247965    .0801664
high_school_percent |   .0088685   .0014378     6.17   0.000     .0060455    .0116916
      ageatelection |  -.0003093   .0006352    -0.49   0.626    -.0015566     .000938
              _cons |     .29786   .0659838     4.51   0.000     .1683019    .4274182
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =       8.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1726
                                                Root MSE          =       .151

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007925   .0005563     1.42   0.155    -.0002998    .0018848
       gov_magm_per |  -.0006517   .0007205    -0.90   0.366    -.0020665     .000763
      org_admin_per |  -.0004432   .0005105    -0.87   0.386    -.0014456    .0005591
      budg_magm_per |   .0002246   .0005882     0.38   0.703    -.0009303    .0013795
    fiscal_magm_per |  -.0005951   .0006204    -0.96   0.338    -.0018133     .000623
    service_dev_per |   .0008162    .000722     1.13   0.259    -.0006015    .0022339
        jud_exe_per |  -.0006306   .0005406    -1.17   0.244     -.001692    .0004308
      phy_infra_per |   .0007738   .0004369     1.77   0.077    -.0000839    .0016316
        soc_inc_per |  -.0000646   .0003785    -0.17   0.865    -.0008079    .0006787
     env_protec_per |  -.0004536   .0004979    -0.91   0.363    -.0014312    .0005239
            fed_cop |   .0003544   .0002439     1.45   0.147    -.0001246    .0008333
            ddc_cop |   .0000996   .0001797     0.55   0.580    -.0002532    .0004524
  ln_baseline_nl_km |   .0533613   .0139233     3.83   0.000      .026023    .0806997
high_school_percent |   .0087196   .0014339     6.08   0.000     .0059041     .011535
      ageatelection |  -.0002338    .000642    -0.36   0.716    -.0014944    .0010267
             female |    .071305   .0499696     1.43   0.154    -.0268098    .1694198
              _cons |   .2944198   .0660265     4.46   0.000     .1647776    .4240621
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =       8.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1754
                                                Root MSE          =     .15085

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008685   .0005694     1.53   0.128    -.0002494    .0019865
       gov_magm_per |  -.0006303   .0007154    -0.88   0.379     -.002035    .0007744
      org_admin_per |  -.0004426   .0005093    -0.87   0.385    -.0014425    .0005574
      budg_magm_per |   .0002747   .0005883     0.47   0.641    -.0008804    .0014299
    fiscal_magm_per |  -.0005781   .0006192    -0.93   0.351    -.0017939    .0006376
    service_dev_per |   .0007116   .0007124     1.00   0.318    -.0006871    .0021103
        jud_exe_per |  -.0005791   .0005297    -1.09   0.275    -.0016192     .000461
      phy_infra_per |   .0008291   .0004361     1.90   0.058    -.0000271    .0016853
        soc_inc_per |  -.0000492   .0003787    -0.13   0.897    -.0007929    .0006944
     env_protec_per |  -.0004865   .0004981    -0.98   0.329    -.0014646    .0004915
            fed_cop |   .0003577    .000244     1.47   0.143    -.0001214    .0008368
            ddc_cop |   .0000868   .0001796     0.48   0.629    -.0002657    .0004394
  ln_baseline_nl_km |   .0528801   .0138319     3.82   0.000     .0257212    .0800389
high_school_percent |   .0088639   .0014345     6.18   0.000     .0060474    .0116805
      ageatelection |  -.0003743   .0006552    -0.57   0.568    -.0016609    .0009122
             female |   .0714609   .0513932     1.39   0.165    -.0294494    .1723712
     gov_coalitiion |  -.0182638   .0119828    -1.52   0.128     -.041792    .0052643
              _cons |    .305508    .067573     4.52   0.000     .1728287    .4381873
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       8.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2072
                                                Root MSE          =     .14803

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007805   .0005732     1.36   0.174     -.000345     .001906
       gov_magm_per |  -.0006704   .0007093    -0.95   0.345    -.0020632    .0007223
      org_admin_per |  -.0000901   .0005031    -0.18   0.858    -.0010779    .0008977
      budg_magm_per |   .0002552   .0005695     0.45   0.654    -.0008631    .0013735
    fiscal_magm_per |  -.0005773    .000609    -0.95   0.344    -.0017731    .0006185
    service_dev_per |   .0007639   .0006957     1.10   0.273    -.0006021    .0021299
        jud_exe_per |  -.0008401   .0005292    -1.59   0.113    -.0018792    .0001991
      phy_infra_per |   .0005011   .0004365     1.15   0.251    -.0003558    .0013581
        soc_inc_per |  -.0000673   .0003618    -0.19   0.853    -.0007775     .000643
     env_protec_per |   -.000927   .0004908    -1.89   0.059    -.0018907    .0000367
            fed_cop |    .000442   .0002402     1.84   0.066    -.0000296    .0009135
            ddc_cop |   .0000816   .0001765     0.46   0.644    -.0002649    .0004282
  ln_baseline_nl_km |   .0058137   .0169914     0.34   0.732    -.0275489    .0391762
high_school_percent |   .0087534   .0014206     6.16   0.000      .005964    .0115428
      ageatelection |  -.0004808   .0006326    -0.76   0.447     -.001723    .0007613
             female |   .0642259   .0505857     1.27   0.205    -.0350991     .163551
     gov_coalitiion |  -.0187631   .0117716    -1.59   0.111    -.0418767    .0043504
            ln_popn |   .0540301   .0094489     5.72   0.000     .0354773     .072583
              _cons |  -.2001673   .1069272    -1.87   0.062     -.410119    .0097843
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(19, 671)        =       8.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2117
                                                Root MSE          =     .14772

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008216   .0005731     1.43   0.152    -.0003038    .0019469
       gov_magm_per |  -.0007043     .00071    -0.99   0.322    -.0020984    .0006898
      org_admin_per |  -.0001081   .0004966    -0.22   0.828    -.0010832    .0008671
      budg_magm_per |   .0002431   .0005724     0.42   0.671    -.0008808    .0013669
    fiscal_magm_per |  -.0006946   .0006052    -1.15   0.252    -.0018829    .0004937
    service_dev_per |   .0008586   .0006961     1.23   0.218    -.0005082    .0022255
        jud_exe_per |  -.0009418   .0005332    -1.77   0.078    -.0019887    .0001051
      phy_infra_per |   .0005793   .0004358     1.33   0.184    -.0002765    .0014351
        soc_inc_per |  -.0000581   .0003612    -0.16   0.872    -.0007674    .0006512
     env_protec_per |  -.0008658   .0004853    -1.78   0.075    -.0018187    .0000871
            fed_cop |    .000458   .0002394     1.91   0.056     -.000012    .0009281
            ddc_cop |   .0000492   .0001768     0.28   0.781    -.0002978    .0003963
  ln_baseline_nl_km |   .0016619   .0171199     0.10   0.923    -.0319532    .0352769
high_school_percent |   .0093654   .0015077     6.21   0.000     .0064051    .0123257
      ageatelection |  -.0005216   .0006318    -0.83   0.409    -.0017623     .000719
             female |    .061664   .0503927     1.22   0.222    -.0372824    .1606103
     gov_coalitiion |   -.020317    .011815    -1.72   0.086    -.0435158    .0028818
            ln_popn |   .0660817   .0119268     5.54   0.000     .0426633    .0895001
          urban_num |  -.0305451   .0170186    -1.79   0.073    -.0639613    .0028711
              _cons |  -.3068519   .1282078    -2.39   0.017    -.5585887   -.0551151
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =       4.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0634
                                                Root MSE          =     .16018

---------------------------------------------------------------------------------
                |               Robust
      rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
   gov_magm_per |  -.0003768   .0007463    -0.50   0.614    -.0018421    .0010884
  org_admin_per |  -.0008685    .000559    -1.55   0.121    -.0019661    .0002291
  budg_magm_per |   .0002557   .0005985     0.43   0.669    -.0009194    .0014308
fiscal_magm_per |   -.001212   .0006408    -1.89   0.059    -.0024702    .0000462
service_dev_per |   .0008511   .0007624     1.12   0.265    -.0006457     .002348
    jud_exe_per |  -.0004291    .000566    -0.76   0.449    -.0015405    .0006822
  phy_infra_per |   .0010623   .0004551     2.33   0.020     .0001687     .001956
    soc_inc_per |   .0000415   .0004016     0.10   0.918    -.0007469    .0008299
 env_protec_per |   .0001394   .0005081     0.27   0.784    -.0008582     .001137
        fed_cop |   -.000114   .0002821    -0.40   0.686    -.0006679    .0004398
      local_cop |   .0011702   .0002748     4.26   0.000     .0006306    .0017098
        ddc_cop |  -.0000938   .0001835    -0.51   0.609    -.0004541    .0002664
          _cons |   .3817987   .0623927     6.12   0.000     .2592925    .5043049
---------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =       6.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1219
                                                Root MSE          =     .15522

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
     gov_magm_per |  -.0002496   .0007197    -0.35   0.729    -.0016628    .0011636
    org_admin_per |  -.0007287   .0005383    -1.35   0.176    -.0017856    .0003282
    budg_magm_per |  -.0000705   .0005821    -0.12   0.904    -.0012135    .0010724
  fiscal_magm_per |  -.0005432   .0006234    -0.87   0.384    -.0017671    .0006808
  service_dev_per |   .0007813   .0007467     1.05   0.296    -.0006848    .0022474
      jud_exe_per |  -.0001081   .0005544    -0.19   0.845    -.0011966    .0009804
    phy_infra_per |   .0007089   .0004417     1.60   0.109    -.0001584    .0015761
      soc_inc_per |   .0002529    .000394     0.64   0.521    -.0005206    .0010265
   env_protec_per |  -.0002621   .0004946    -0.53   0.596    -.0012333    .0007092
          fed_cop |   .0000164   .0002778     0.06   0.953    -.0005291    .0005619
        local_cop |   .0009602   .0002727     3.52   0.000     .0004248    .0014957
          ddc_cop |  -.0000594   .0001768    -0.34   0.737    -.0004065    .0002877
ln_baseline_nl_km |   .0730885   .0135189     5.41   0.000     .0465444    .0996325
            _cons |    .318183   .0604668     5.26   0.000     .1994579    .4369081
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =       9.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1783
                                                Root MSE          =     .15026

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005011   .0007105    -0.71   0.481    -.0018962    .0008939
      org_admin_per |   -.000372   .0005204    -0.71   0.475    -.0013938    .0006498
      budg_magm_per |   .0000156    .000566     0.03   0.978    -.0010957    .0011269
    fiscal_magm_per |   -.000639   .0006049    -1.06   0.291    -.0018268    .0005487
    service_dev_per |   .0006663    .000722     0.92   0.356    -.0007514     .002084
        jud_exe_per |  -.0006856   .0005415    -1.27   0.206    -.0017487    .0003776
      phy_infra_per |   .0006389   .0004359     1.47   0.143    -.0002169    .0014948
        soc_inc_per |   .0000787   .0003799     0.21   0.836    -.0006672    .0008247
     env_protec_per |  -.0006822   .0004834    -1.41   0.159    -.0016313     .000267
            fed_cop |   9.46e-06   .0002677     0.04   0.972    -.0005161     .000535
          local_cop |   .0008299   .0002628     3.16   0.002     .0003138     .001346
            ddc_cop |  -.0000171   .0001758    -0.10   0.923    -.0003622     .000328
  ln_baseline_nl_km |   .0445753   .0128204     3.48   0.001     .0194027     .069748
high_school_percent |   .0090358   .0013917     6.49   0.000     .0063032    .0117685
              _cons |   .3084723   .0587705     5.25   0.000     .1930776    .4238669
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =       9.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1786
                                                Root MSE          =     .15034

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0004735   .0007089    -0.67   0.504    -.0018655    .0009184
      org_admin_per |  -.0003792   .0005199    -0.73   0.466    -.0013999    .0006416
      budg_magm_per |   .0000153   .0005666     0.03   0.979    -.0010973    .0011278
    fiscal_magm_per |  -.0006458    .000605    -1.07   0.286    -.0018337    .0005422
    service_dev_per |    .000672   .0007224     0.93   0.353    -.0007464    .0020905
        jud_exe_per |  -.0006702   .0005395    -1.24   0.215    -.0017296    .0003892
      phy_infra_per |   .0006548   .0004366     1.50   0.134    -.0002025    .0015121
        soc_inc_per |   .0000744   .0003815     0.20   0.845    -.0006747    .0008235
     env_protec_per |  -.0007158   .0004872    -1.47   0.142    -.0016725    .0002408
            fed_cop |   .0000146   .0002674     0.05   0.956    -.0005105    .0005397
          local_cop |   .0008362   .0002646     3.16   0.002     .0003167    .0013558
            ddc_cop |  -.0000135   .0001768    -0.08   0.939    -.0003606    .0003336
  ln_baseline_nl_km |   .0452931    .013063     3.47   0.001     .0196442     .070942
high_school_percent |    .009065   .0013898     6.52   0.000     .0063362    .0117938
      ageatelection |  -.0003211   .0006265    -0.51   0.608    -.0015512     .000909
              _cons |   .3212328   .0669255     4.80   0.000     .1898256    .4526399
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =       9.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1816
                                                Root MSE          =     .15017

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0004996    .000711    -0.70   0.483    -.0018955    .0008964
      org_admin_per |  -.0003801   .0005205    -0.73   0.466    -.0014022     .000642
      budg_magm_per |   .0000787   .0005731     0.14   0.891    -.0010465    .0012039
    fiscal_magm_per |  -.0006735   .0006094    -1.11   0.269    -.0018699     .000523
    service_dev_per |    .000689    .000722     0.95   0.340    -.0007286    .0021067
        jud_exe_per |  -.0006669   .0005389    -1.24   0.216     -.001725    .0003912
      phy_infra_per |   .0006639   .0004369     1.52   0.129    -.0001938    .0015217
        soc_inc_per |   .0000278   .0003804     0.07   0.942    -.0007191    .0007746
     env_protec_per |  -.0007054   .0004854    -1.45   0.147    -.0016584    .0002477
            fed_cop |   .0000269   .0002669     0.10   0.920     -.000497    .0005509
          local_cop |   .0008236   .0002656     3.10   0.002      .000302    .0013451
            ddc_cop |  -.0000128   .0001772    -0.07   0.942    -.0003608    .0003351
  ln_baseline_nl_km |   .0460019   .0129502     3.55   0.000     .0205742    .0714295
high_school_percent |   .0089493   .0013911     6.43   0.000     .0062179    .0116807
      ageatelection |  -.0002479   .0006332    -0.39   0.695    -.0014912    .0009954
             female |   .0651388   .0497564     1.31   0.191    -.0325573     .162835
              _cons |   .3177358     .06703     4.74   0.000     .1861232    .4493485
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =       8.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1841
                                                Root MSE          =     .15006

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0004716   .0007061    -0.67   0.504     -.001858    .0009147
      org_admin_per |  -.0003778     .00052    -0.73   0.468    -.0013987    .0006432
      budg_magm_per |    .000119    .000572     0.21   0.835    -.0010042    .0012421
    fiscal_magm_per |  -.0006584   .0006082    -1.08   0.279    -.0018527    .0005359
    service_dev_per |   .0005891   .0007127     0.83   0.409    -.0008103    .0019886
        jud_exe_per |  -.0006194   .0005292    -1.17   0.242    -.0016586    .0004198
      phy_infra_per |   .0007167    .000436     1.64   0.101    -.0001393    .0015727
        soc_inc_per |   .0000445   .0003805     0.12   0.907    -.0007027    .0007917
     env_protec_per |  -.0007395   .0004875    -1.52   0.130    -.0016967    .0002176
            fed_cop |   .0000257   .0002669     0.10   0.923    -.0004982    .0005497
          local_cop |   .0008318   .0002673     3.11   0.002      .000307    .0013566
            ddc_cop |   -.000025   .0001769    -0.14   0.888    -.0003724    .0003225
  ln_baseline_nl_km |   .0451233   .0128998     3.50   0.000     .0197945     .070452
high_school_percent |   .0091263   .0014014     6.51   0.000     .0063746     .011878
      ageatelection |  -.0003709   .0006421    -0.58   0.564    -.0016317    .0008899
             female |   .0650539   .0510145     1.28   0.203    -.0351127    .1652206
     gov_coalitiion |  -.0168668    .011533    -1.46   0.144    -.0395118    .0057782
              _cons |   .3282174    .068478     4.79   0.000     .1937611    .4626736
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion ln
> _popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       9.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2128
                                                Root MSE          =     .14751

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005299   .0006998    -0.76   0.449     -.001904    .0008442
      org_admin_per |  -.0000505   .0005106    -0.10   0.921     -.001053    .0009519
      budg_magm_per |    .000121   .0005573     0.22   0.828    -.0009732    .0012153
    fiscal_magm_per |  -.0006447   .0005984    -1.08   0.282    -.0018197    .0005304
    service_dev_per |   .0006579   .0006954     0.95   0.344    -.0007075    .0020234
        jud_exe_per |  -.0008624   .0005289    -1.63   0.103    -.0019009     .000176
      phy_infra_per |   .0004235   .0004357     0.97   0.331     -.000432     .001279
        soc_inc_per |   .0000135   .0003634     0.04   0.970       -.0007     .000727
     env_protec_per |  -.0011204    .000484    -2.31   0.021    -.0020707     -.00017
            fed_cop |   .0001588   .0002647     0.60   0.549    -.0003609    .0006784
          local_cop |   .0006978    .000262     2.66   0.008     .0001833    .0012122
            ddc_cop |  -.0000112   .0001746    -0.06   0.949     -.000354    .0003317
  ln_baseline_nl_km |   .0010894   .0161401     0.07   0.946    -.0306017    .0327806
high_school_percent |    .009014   .0013871     6.50   0.000     .0062903    .0117376
      ageatelection |   -.000466   .0006208    -0.75   0.453    -.0016849     .000753
             female |   .0590243   .0505927     1.17   0.244    -.0403146    .1583631
     gov_coalitiion |  -.0174232   .0113195    -1.54   0.124     -.039649    .0048026
            ln_popn |   .0516209   .0093198     5.54   0.000     .0333215    .0699203
              _cons |  -.1586496   .1066779    -1.49   0.137    -.3681117    .0508125
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion ln
> _popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       9.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2128
                                                Root MSE          =     .14751

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005299   .0006998    -0.76   0.449     -.001904    .0008442
      org_admin_per |  -.0000505   .0005106    -0.10   0.921     -.001053    .0009519
      budg_magm_per |    .000121   .0005573     0.22   0.828    -.0009732    .0012153
    fiscal_magm_per |  -.0006447   .0005984    -1.08   0.282    -.0018197    .0005304
    service_dev_per |   .0006579   .0006954     0.95   0.344    -.0007075    .0020234
        jud_exe_per |  -.0008624   .0005289    -1.63   0.103    -.0019009     .000176
      phy_infra_per |   .0004235   .0004357     0.97   0.331     -.000432     .001279
        soc_inc_per |   .0000135   .0003634     0.04   0.970       -.0007     .000727
     env_protec_per |  -.0011204    .000484    -2.31   0.021    -.0020707     -.00017
            fed_cop |   .0001588   .0002647     0.60   0.549    -.0003609    .0006784
          local_cop |   .0006978    .000262     2.66   0.008     .0001833    .0012122
            ddc_cop |  -.0000112   .0001746    -0.06   0.949     -.000354    .0003317
  ln_baseline_nl_km |   .0010894   .0161401     0.07   0.946    -.0306017    .0327806
high_school_percent |    .009014   .0013871     6.50   0.000     .0062903    .0117376
      ageatelection |   -.000466   .0006208    -0.75   0.453    -.0016849     .000753
             female |   .0590243   .0505927     1.17   0.244    -.0403146    .1583631
     gov_coalitiion |  -.0174232   .0113195    -1.54   0.124     -.039649    .0048026
            ln_popn |   .0516209   .0093198     5.54   0.000     .0333215    .0699203
              _cons |  -.1586496   .1066779    -1.49   0.137    -.3681117    .0508125
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_in
> c_per env_protec_per fed_cop local_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalitiion ln
> _popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(19, 671)        =       8.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2175
                                                Root MSE          =     .14717

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
       gov_magm_per |  -.0005583   .0007008    -0.80   0.426    -.0019344    .0008177
      org_admin_per |  -.0000673   .0005038    -0.13   0.894    -.0010565    .0009219
      budg_magm_per |   .0001027   .0005601     0.18   0.855    -.0009971    .0012025
    fiscal_magm_per |  -.0007675   .0005946    -1.29   0.197    -.0019351    .0004001
    service_dev_per |   .0007514   .0006943     1.08   0.280    -.0006119    .0021147
        jud_exe_per |  -.0009678   .0005317    -1.82   0.069    -.0020119    .0000762
      phy_infra_per |   .0005016    .000435     1.15   0.249    -.0003525    .0013558
        soc_inc_per |   .0000261    .000363     0.07   0.943    -.0006866    .0007388
     env_protec_per |  -.0010644   .0004788    -2.22   0.027    -.0020046   -.0001243
            fed_cop |   .0001653   .0002629     0.63   0.530    -.0003509    .0006815
          local_cop |   .0007218   .0002601     2.77   0.006      .000211    .0012325
            ddc_cop |  -.0000474   .0001748    -0.27   0.786    -.0003906    .0002957
  ln_baseline_nl_km |  -.0034378   .0163141    -0.21   0.833    -.0354706    .0285949
high_school_percent |   .0096617   .0014808     6.52   0.000     .0067542    .0125692
      ageatelection |  -.0005054   .0006202    -0.81   0.415    -.0017233    .0007124
             female |   .0561694   .0503534     1.12   0.265    -.0426998    .1550386
     gov_coalitiion |  -.0189342   .0113616    -1.67   0.096    -.0412428    .0033744
            ln_popn |   .0639371     .01169     5.47   0.000     .0409837    .0868904
          urban_num |  -.0313949   .0169115    -1.86   0.064    -.0646007     .001811
              _cons |  -.2670107   .1266673    -2.11   0.035    -.5157228   -.0182987
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. 
. regress rel_chgnl neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       4.32
                                                Prob > F          =     0.0380
                                                R-squared         =     0.0065
                                                Root MSE          =     .16365

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .0010373   .0004989     2.08   0.038     .0000577     .002017
           _cons |   .3211642   .0098258    32.69   0.000     .3018722    .3404562
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =       2.81
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0431
                                                Root MSE          =     .16191

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |    .000945   .0005334     1.77   0.077    -.0001023    .0019923
    gov_magm_per |  -.0005903   .0007551    -0.78   0.435    -.0020729    .0008923
   org_admin_per |  -.0009673   .0005492    -1.76   0.079    -.0020455     .000111
   budg_magm_per |   .0004858    .000618     0.79   0.432    -.0007277    .0016994
 fiscal_magm_per |  -.0011784   .0006588    -1.79   0.074    -.0024719     .000115
 service_dev_per |   .0010337   .0007639     1.35   0.176    -.0004661    .0025336
     jud_exe_per |  -.0004248   .0005756    -0.74   0.461     -.001555    .0007054
   phy_infra_per |   .0012733   .0004631     2.75   0.006      .000364    .0021826
     soc_inc_per |  -.0001109      .0004    -0.28   0.782    -.0008962    .0006744
  env_protec_per |   .0005365   .0005242     1.02   0.306    -.0004928    .0015658
         fed_cop |   .0003407   .0002588     1.32   0.188    -.0001674    .0008489
         ddc_cop |   .0000687   .0001874     0.37   0.714    -.0002994    .0004367
           _cons |   .3573428   .0613452     5.83   0.000     .2368933    .4777923
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =       5.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1173
                                                Root MSE          =     .15562

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
 neighbor_percent |   .0014727   .0005382     2.74   0.006      .000416    .0025295
     gov_magm_per |   -.000503   .0007249    -0.69   0.488    -.0019263    .0009203
    org_admin_per |  -.0007852   .0005246    -1.50   0.135    -.0018152    .0002448
    budg_magm_per |   .0001362   .0005993     0.23   0.820    -.0010404    .0013129
  fiscal_magm_per |  -.0004558   .0006363    -0.72   0.474    -.0017051    .0007935
  service_dev_per |   .0009351   .0007428     1.26   0.209    -.0005235    .0023936
      jud_exe_per |  -.0001118   .0005571    -0.20   0.841    -.0012057    .0009821
    phy_infra_per |   .0008021   .0004469     1.79   0.073    -.0000754    .0016795
      soc_inc_per |   .0001265   .0003902     0.32   0.746    -.0006397    .0008927
   env_protec_per |   .0000152   .0005129     0.03   0.976    -.0009919    .0010222
          fed_cop |   .0004011   .0002515     1.59   0.111    -.0000927    .0008948
          ddc_cop |   .0000661   .0001801     0.37   0.714    -.0002874    .0004196
ln_baseline_nl_km |    .082628   .0138488     5.97   0.000     .0554362    .1098197
            _cons |   .2887565   .0590414     4.89   0.000     .1728302    .4046828
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =       8.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1687
                                                Root MSE          =     .15114

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007464   .0005556     1.34   0.180    -.0003444    .0018373
       gov_magm_per |  -.0006455   .0007208    -0.90   0.371    -.0020608    .0007697
      org_admin_per |  -.0004351   .0005108    -0.85   0.395     -.001438    .0005678
      budg_magm_per |   .0001531   .0005806     0.26   0.792     -.000987    .0012932
    fiscal_magm_per |  -.0005575   .0006159    -0.91   0.366    -.0017669    .0006518
    service_dev_per |   .0007916   .0007227     1.10   0.274    -.0006274    .0022106
        jud_exe_per |  -.0006483   .0005436    -1.19   0.233    -.0017156    .0004191
      phy_infra_per |   .0007521   .0004351     1.73   0.084    -.0001022    .0016063
        soc_inc_per |  -8.96e-06    .000378    -0.02   0.981    -.0007511    .0007332
     env_protec_per |  -.0004315   .0004971    -0.87   0.386    -.0014075    .0005445
            fed_cop |   .0003381   .0002447     1.38   0.168    -.0001424    .0008187
            ddc_cop |   .0000971   .0001778     0.55   0.585     -.000252    .0004462
  ln_baseline_nl_km |   .0516579   .0137315     3.76   0.000     .0246963    .0786194
high_school_percent |   .0088515   .0014399     6.15   0.000     .0060244    .0116787
              _cons |   .2858009   .0576037     4.96   0.000     .1726973    .3989045
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =       8.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1690
                                                Root MSE          =     .15122

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007665   .0005615     1.37   0.173     -.000336     .001869
       gov_magm_per |  -.0006217   .0007186    -0.87   0.387    -.0020327    .0007893
      org_admin_per |  -.0004426   .0005101    -0.87   0.386    -.0014443     .000559
      budg_magm_per |   .0001548   .0005815     0.27   0.790    -.0009869    .0012965
    fiscal_magm_per |  -.0005634   .0006163    -0.91   0.361    -.0017736    .0006468
    service_dev_per |   .0007985   .0007233     1.10   0.270    -.0006218    .0022187
        jud_exe_per |  -.0006334   .0005413    -1.17   0.242    -.0016962    .0004294
      phy_infra_per |   .0007675   .0004366     1.76   0.079    -.0000897    .0016247
        soc_inc_per |  -.0000141   .0003798    -0.04   0.970    -.0007598    .0007316
     env_protec_per |  -.0004616   .0005001    -0.92   0.356    -.0014436    .0005203
            fed_cop |   .0003457    .000245     1.41   0.159    -.0001353    .0008268
            ddc_cop |   .0001012   .0001791     0.57   0.572    -.0002505    .0004529
  ln_baseline_nl_km |   .0524815   .0140999     3.72   0.000     .0247965    .0801664
high_school_percent |   .0088685   .0014378     6.17   0.000     .0060455    .0116916
      ageatelection |  -.0003093   .0006352    -0.49   0.626    -.0015566     .000938
              _cons |     .29786   .0659838     4.51   0.000     .1683019    .4274182
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =       8.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1726
                                                Root MSE          =       .151

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007925   .0005563     1.42   0.155    -.0002998    .0018848
       gov_magm_per |  -.0006517   .0007205    -0.90   0.366    -.0020665     .000763
      org_admin_per |  -.0004432   .0005105    -0.87   0.386    -.0014456    .0005591
      budg_magm_per |   .0002246   .0005882     0.38   0.703    -.0009303    .0013795
    fiscal_magm_per |  -.0005951   .0006204    -0.96   0.338    -.0018133     .000623
    service_dev_per |   .0008162    .000722     1.13   0.259    -.0006015    .0022339
        jud_exe_per |  -.0006306   .0005406    -1.17   0.244     -.001692    .0004308
      phy_infra_per |   .0007738   .0004369     1.77   0.077    -.0000839    .0016316
        soc_inc_per |  -.0000646   .0003785    -0.17   0.865    -.0008079    .0006787
     env_protec_per |  -.0004536   .0004979    -0.91   0.363    -.0014312    .0005239
            fed_cop |   .0003544   .0002439     1.45   0.147    -.0001246    .0008333
            ddc_cop |   .0000996   .0001797     0.55   0.580    -.0002532    .0004524
  ln_baseline_nl_km |   .0533613   .0139233     3.83   0.000      .026023    .0806997
high_school_percent |   .0087196   .0014339     6.08   0.000     .0059041     .011535
      ageatelection |  -.0002338    .000642    -0.36   0.716    -.0014944    .0010267
             female |    .071305   .0499696     1.43   0.154    -.0268098    .1694198
              _cons |   .2944198   .0660265     4.46   0.000     .1647776    .4240621
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =       8.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1754
                                                Root MSE          =     .15085

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008685   .0005694     1.53   0.128    -.0002494    .0019865
       gov_magm_per |  -.0006303   .0007154    -0.88   0.379     -.002035    .0007744
      org_admin_per |  -.0004426   .0005093    -0.87   0.385    -.0014425    .0005574
      budg_magm_per |   .0002747   .0005883     0.47   0.641    -.0008804    .0014299
    fiscal_magm_per |  -.0005781   .0006192    -0.93   0.351    -.0017939    .0006376
    service_dev_per |   .0007116   .0007124     1.00   0.318    -.0006871    .0021103
        jud_exe_per |  -.0005791   .0005297    -1.09   0.275    -.0016192     .000461
      phy_infra_per |   .0008291   .0004361     1.90   0.058    -.0000271    .0016853
        soc_inc_per |  -.0000492   .0003787    -0.13   0.897    -.0007929    .0006944
     env_protec_per |  -.0004865   .0004981    -0.98   0.329    -.0014646    .0004915
            fed_cop |   .0003577    .000244     1.47   0.143    -.0001214    .0008368
            ddc_cop |   .0000868   .0001796     0.48   0.629    -.0002657    .0004394
  ln_baseline_nl_km |   .0528801   .0138319     3.82   0.000     .0257212    .0800389
high_school_percent |   .0088639   .0014345     6.18   0.000     .0060474    .0116805
      ageatelection |  -.0003743   .0006552    -0.57   0.568    -.0016609    .0009122
             female |   .0714609   .0513932     1.39   0.165    -.0294494    .1723712
     gov_coalitiion |  -.0182638   .0119828    -1.52   0.128     -.041792    .0052643
              _cons |    .305508    .067573     4.52   0.000     .1728287    .4381873
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       8.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2072
                                                Root MSE          =     .14803

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007805   .0005732     1.36   0.174     -.000345     .001906
       gov_magm_per |  -.0006704   .0007093    -0.95   0.345    -.0020632    .0007223
      org_admin_per |  -.0000901   .0005031    -0.18   0.858    -.0010779    .0008977
      budg_magm_per |   .0002552   .0005695     0.45   0.654    -.0008631    .0013735
    fiscal_magm_per |  -.0005773    .000609    -0.95   0.344    -.0017731    .0006185
    service_dev_per |   .0007639   .0006957     1.10   0.273    -.0006021    .0021299
        jud_exe_per |  -.0008401   .0005292    -1.59   0.113    -.0018792    .0001991
      phy_infra_per |   .0005011   .0004365     1.15   0.251    -.0003558    .0013581
        soc_inc_per |  -.0000673   .0003618    -0.19   0.853    -.0007775     .000643
     env_protec_per |   -.000927   .0004908    -1.89   0.059    -.0018907    .0000367
            fed_cop |    .000442   .0002402     1.84   0.066    -.0000296    .0009135
            ddc_cop |   .0000816   .0001765     0.46   0.644    -.0002649    .0004282
  ln_baseline_nl_km |   .0058137   .0169914     0.34   0.732    -.0275489    .0391762
high_school_percent |   .0087534   .0014206     6.16   0.000      .005964    .0115428
      ageatelection |  -.0004808   .0006326    -0.76   0.447     -.001723    .0007613
             female |   .0642259   .0505857     1.27   0.205    -.0350991     .163551
     gov_coalitiion |  -.0187631   .0117716    -1.59   0.111    -.0418767    .0043504
            ln_popn |   .0540301   .0094489     5.72   0.000     .0354773     .072583
              _cons |  -.2001673   .1069272    -1.87   0.062     -.410119    .0097843
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(19, 671)        =       8.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2117
                                                Root MSE          =     .14772

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008216   .0005731     1.43   0.152    -.0003038    .0019469
       gov_magm_per |  -.0007043     .00071    -0.99   0.322    -.0020984    .0006898
      org_admin_per |  -.0001081   .0004966    -0.22   0.828    -.0010832    .0008671
      budg_magm_per |   .0002431   .0005724     0.42   0.671    -.0008808    .0013669
    fiscal_magm_per |  -.0006946   .0006052    -1.15   0.252    -.0018829    .0004937
    service_dev_per |   .0008586   .0006961     1.23   0.218    -.0005082    .0022255
        jud_exe_per |  -.0009418   .0005332    -1.77   0.078    -.0019887    .0001051
      phy_infra_per |   .0005793   .0004358     1.33   0.184    -.0002765    .0014351
        soc_inc_per |  -.0000581   .0003612    -0.16   0.872    -.0007674    .0006512
     env_protec_per |  -.0008658   .0004853    -1.78   0.075    -.0018187    .0000871
            fed_cop |    .000458   .0002394     1.91   0.056     -.000012    .0009281
            ddc_cop |   .0000492   .0001768     0.28   0.781    -.0002978    .0003963
  ln_baseline_nl_km |   .0016619   .0171199     0.10   0.923    -.0319532    .0352769
high_school_percent |   .0093654   .0015077     6.21   0.000     .0064051    .0123257
      ageatelection |  -.0005216   .0006318    -0.83   0.409    -.0017623     .000719
             female |    .061664   .0503927     1.22   0.222    -.0372824    .1606103
     gov_coalitiion |   -.020317    .011815    -1.72   0.086    -.0435158    .0028818
            ln_popn |   .0660817   .0119268     5.54   0.000     .0426633    .0895001
          urban_num |  -.0305451   .0170186    -1.79   0.073    -.0639613    .0028711
              _cons |  -.3068519   .1282078    -2.39   0.017    -.5585887   -.0551151
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. 
. regress rel_chgnl neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       4.32
                                                Prob > F          =     0.0380
                                                R-squared         =     0.0065
                                                Root MSE          =     .16365

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .0010373   .0004989     2.08   0.038     .0000577     .002017
           _cons |   .3211642   .0098258    32.69   0.000     .3018722    .3404562
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, replace dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(12, 678)        =       2.81
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0431
                                                Root MSE          =     .16191

----------------------------------------------------------------------------------
                 |               Robust
       rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |    .000945   .0005334     1.77   0.077    -.0001023    .0019923
    gov_magm_per |  -.0005903   .0007551    -0.78   0.435    -.0020729    .0008923
   org_admin_per |  -.0009673   .0005492    -1.76   0.079    -.0020455     .000111
   budg_magm_per |   .0004858    .000618     0.79   0.432    -.0007277    .0016994
 fiscal_magm_per |  -.0011784   .0006588    -1.79   0.074    -.0024719     .000115
 service_dev_per |   .0010337   .0007639     1.35   0.176    -.0004661    .0025336
     jud_exe_per |  -.0004248   .0005756    -0.74   0.461     -.001555    .0007054
   phy_infra_per |   .0012733   .0004631     2.75   0.006      .000364    .0021826
     soc_inc_per |  -.0001109      .0004    -0.28   0.782    -.0008962    .0006744
  env_protec_per |   .0005365   .0005242     1.02   0.306    -.0004928    .0015658
         fed_cop |   .0003407   .0002588     1.32   0.188    -.0001674    .0008489
         ddc_cop |   .0000687   .0001874     0.37   0.714    -.0002994    .0004367
           _cons |   .3573428   .0613452     5.83   0.000     .2368933    .4777923
----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km, r

Linear regression                               Number of obs     =        691
                                                F(13, 677)        =       5.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1173
                                                Root MSE          =     .15562

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
 neighbor_percent |   .0014727   .0005382     2.74   0.006      .000416    .0025295
     gov_magm_per |   -.000503   .0007249    -0.69   0.488    -.0019263    .0009203
    org_admin_per |  -.0007852   .0005246    -1.50   0.135    -.0018152    .0002448
    budg_magm_per |   .0001362   .0005993     0.23   0.820    -.0010404    .0013129
  fiscal_magm_per |  -.0004558   .0006363    -0.72   0.474    -.0017051    .0007935
  service_dev_per |   .0009351   .0007428     1.26   0.209    -.0005235    .0023936
      jud_exe_per |  -.0001118   .0005571    -0.20   0.841    -.0012057    .0009821
    phy_infra_per |   .0008021   .0004469     1.79   0.073    -.0000754    .0016795
      soc_inc_per |   .0001265   .0003902     0.32   0.746    -.0006397    .0008927
   env_protec_per |   .0000152   .0005129     0.03   0.976    -.0009919    .0010222
          fed_cop |   .0004011   .0002515     1.59   0.111    -.0000927    .0008948
          ddc_cop |   .0000661   .0001801     0.37   0.714    -.0002874    .0004196
ln_baseline_nl_km |    .082628   .0138488     5.97   0.000     .0554362    .1098197
            _cons |   .2887565   .0590414     4.89   0.000     .1728302    .4046828
-----------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(14, 676)        =       8.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1687
                                                Root MSE          =     .15114

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007464   .0005556     1.34   0.180    -.0003444    .0018373
       gov_magm_per |  -.0006455   .0007208    -0.90   0.371    -.0020608    .0007697
      org_admin_per |  -.0004351   .0005108    -0.85   0.395     -.001438    .0005678
      budg_magm_per |   .0001531   .0005806     0.26   0.792     -.000987    .0012932
    fiscal_magm_per |  -.0005575   .0006159    -0.91   0.366    -.0017669    .0006518
    service_dev_per |   .0007916   .0007227     1.10   0.274    -.0006274    .0022106
        jud_exe_per |  -.0006483   .0005436    -1.19   0.233    -.0017156    .0004191
      phy_infra_per |   .0007521   .0004351     1.73   0.084    -.0001022    .0016063
        soc_inc_per |  -8.96e-06    .000378    -0.02   0.981    -.0007511    .0007332
     env_protec_per |  -.0004315   .0004971    -0.87   0.386    -.0014075    .0005445
            fed_cop |   .0003381   .0002447     1.38   0.168    -.0001424    .0008187
            ddc_cop |   .0000971   .0001778     0.55   0.585     -.000252    .0004462
  ln_baseline_nl_km |   .0516579   .0137315     3.76   0.000     .0246963    .0786194
high_school_percent |   .0088515   .0014399     6.15   0.000     .0060244    .0116787
              _cons |   .2858009   .0576037     4.96   0.000     .1726973    .3989045
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =       8.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1690
                                                Root MSE          =     .15122

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007665   .0005615     1.37   0.173     -.000336     .001869
       gov_magm_per |  -.0006217   .0007186    -0.87   0.387    -.0020327    .0007893
      org_admin_per |  -.0004426   .0005101    -0.87   0.386    -.0014443     .000559
      budg_magm_per |   .0001548   .0005815     0.27   0.790    -.0009869    .0012965
    fiscal_magm_per |  -.0005634   .0006163    -0.91   0.361    -.0017736    .0006468
    service_dev_per |   .0007985   .0007233     1.10   0.270    -.0006218    .0022187
        jud_exe_per |  -.0006334   .0005413    -1.17   0.242    -.0016962    .0004294
      phy_infra_per |   .0007675   .0004366     1.76   0.079    -.0000897    .0016247
        soc_inc_per |  -.0000141   .0003798    -0.04   0.970    -.0007598    .0007316
     env_protec_per |  -.0004616   .0005001    -0.92   0.356    -.0014436    .0005203
            fed_cop |   .0003457    .000245     1.41   0.159    -.0001353    .0008268
            ddc_cop |   .0001012   .0001791     0.57   0.572    -.0002505    .0004529
  ln_baseline_nl_km |   .0524815   .0140999     3.72   0.000     .0247965    .0801664
high_school_percent |   .0088685   .0014378     6.17   0.000     .0060455    .0116916
      ageatelection |  -.0003093   .0006352    -0.49   0.626    -.0015566     .000938
              _cons |     .29786   .0659838     4.51   0.000     .1683019    .4274182
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(16, 674)        =       8.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1726
                                                Root MSE          =       .151

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007925   .0005563     1.42   0.155    -.0002998    .0018848
       gov_magm_per |  -.0006517   .0007205    -0.90   0.366    -.0020665     .000763
      org_admin_per |  -.0004432   .0005105    -0.87   0.386    -.0014456    .0005591
      budg_magm_per |   .0002246   .0005882     0.38   0.703    -.0009303    .0013795
    fiscal_magm_per |  -.0005951   .0006204    -0.96   0.338    -.0018133     .000623
    service_dev_per |   .0008162    .000722     1.13   0.259    -.0006015    .0022339
        jud_exe_per |  -.0006306   .0005406    -1.17   0.244     -.001692    .0004308
      phy_infra_per |   .0007738   .0004369     1.77   0.077    -.0000839    .0016316
        soc_inc_per |  -.0000646   .0003785    -0.17   0.865    -.0008079    .0006787
     env_protec_per |  -.0004536   .0004979    -0.91   0.363    -.0014312    .0005239
            fed_cop |   .0003544   .0002439     1.45   0.147    -.0001246    .0008333
            ddc_cop |   .0000996   .0001797     0.55   0.580    -.0002532    .0004524
  ln_baseline_nl_km |   .0533613   .0139233     3.83   0.000      .026023    .0806997
high_school_percent |   .0087196   .0014339     6.08   0.000     .0059041     .011535
      ageatelection |  -.0002338    .000642    -0.36   0.716    -.0014944    .0010267
             female |    .071305   .0499696     1.43   0.154    -.0268098    .1694198
              _cons |   .2944198   .0660265     4.46   0.000     .1647776    .4240621
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =       8.08
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1754
                                                Root MSE          =     .15085

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008685   .0005694     1.53   0.128    -.0002494    .0019865
       gov_magm_per |  -.0006303   .0007154    -0.88   0.379     -.002035    .0007744
      org_admin_per |  -.0004426   .0005093    -0.87   0.385    -.0014425    .0005574
      budg_magm_per |   .0002747   .0005883     0.47   0.641    -.0008804    .0014299
    fiscal_magm_per |  -.0005781   .0006192    -0.93   0.351    -.0017939    .0006376
    service_dev_per |   .0007116   .0007124     1.00   0.318    -.0006871    .0021103
        jud_exe_per |  -.0005791   .0005297    -1.09   0.275    -.0016192     .000461
      phy_infra_per |   .0008291   .0004361     1.90   0.058    -.0000271    .0016853
        soc_inc_per |  -.0000492   .0003787    -0.13   0.897    -.0007929    .0006944
     env_protec_per |  -.0004865   .0004981    -0.98   0.329    -.0014646    .0004915
            fed_cop |   .0003577    .000244     1.47   0.143    -.0001214    .0008368
            ddc_cop |   .0000868   .0001796     0.48   0.629    -.0002657    .0004394
  ln_baseline_nl_km |   .0528801   .0138319     3.82   0.000     .0257212    .0800389
high_school_percent |   .0088639   .0014345     6.18   0.000     .0060474    .0116805
      ageatelection |  -.0003743   .0006552    -0.57   0.568    -.0016609    .0009122
             female |   .0714609   .0513932     1.39   0.165    -.0294494    .1723712
     gov_coalitiion |  -.0182638   .0119828    -1.52   0.128     -.041792    .0052643
              _cons |    .305508    .067573     4.52   0.000     .1728287    .4381873
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(18, 672)        =       8.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2072
                                                Root MSE          =     .14803

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0007805   .0005732     1.36   0.174     -.000345     .001906
       gov_magm_per |  -.0006704   .0007093    -0.95   0.345    -.0020632    .0007223
      org_admin_per |  -.0000901   .0005031    -0.18   0.858    -.0010779    .0008977
      budg_magm_per |   .0002552   .0005695     0.45   0.654    -.0008631    .0013735
    fiscal_magm_per |  -.0005773    .000609    -0.95   0.344    -.0017731    .0006185
    service_dev_per |   .0007639   .0006957     1.10   0.273    -.0006021    .0021299
        jud_exe_per |  -.0008401   .0005292    -1.59   0.113    -.0018792    .0001991
      phy_infra_per |   .0005011   .0004365     1.15   0.251    -.0003558    .0013581
        soc_inc_per |  -.0000673   .0003618    -0.19   0.853    -.0007775     .000643
     env_protec_per |   -.000927   .0004908    -1.89   0.059    -.0018907    .0000367
            fed_cop |    .000442   .0002402     1.84   0.066    -.0000296    .0009135
            ddc_cop |   .0000816   .0001765     0.46   0.644    -.0002649    .0004282
  ln_baseline_nl_km |   .0058137   .0169914     0.34   0.732    -.0275489    .0391762
high_school_percent |   .0087534   .0014206     6.16   0.000      .005964    .0115428
      ageatelection |  -.0004808   .0006326    -0.76   0.447     -.001723    .0007613
             female |   .0642259   .0505857     1.27   0.205    -.0350991     .163551
     gov_coalitiion |  -.0187631   .0117716    -1.59   0.111    -.0418767    .0043504
            ln_popn |   .0540301   .0094489     5.72   0.000     .0354773     .072583
              _cons |  -.2001673   .1069272    -1.87   0.062     -.410119    .0097843
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
. regress rel_chgnl neighbor_percent gov_magm_per org_admin_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy
> _infra_per soc_inc_per env_protec_per fed_cop ddc_cop ln_baseline_nl_km high_school_percent ageatelection female gov_coalit
> iion ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(19, 671)        =       8.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2117
                                                Root MSE          =     .14772

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0008216   .0005731     1.43   0.152    -.0003038    .0019469
       gov_magm_per |  -.0007043     .00071    -0.99   0.322    -.0020984    .0006898
      org_admin_per |  -.0001081   .0004966    -0.22   0.828    -.0010832    .0008671
      budg_magm_per |   .0002431   .0005724     0.42   0.671    -.0008808    .0013669
    fiscal_magm_per |  -.0006946   .0006052    -1.15   0.252    -.0018829    .0004937
    service_dev_per |   .0008586   .0006961     1.23   0.218    -.0005082    .0022255
        jud_exe_per |  -.0009418   .0005332    -1.77   0.078    -.0019887    .0001051
      phy_infra_per |   .0005793   .0004358     1.33   0.184    -.0002765    .0014351
        soc_inc_per |  -.0000581   .0003612    -0.16   0.872    -.0007674    .0006512
     env_protec_per |  -.0008658   .0004853    -1.78   0.075    -.0018187    .0000871
            fed_cop |    .000458   .0002394     1.91   0.056     -.000012    .0009281
            ddc_cop |   .0000492   .0001768     0.28   0.781    -.0002978    .0003963
  ln_baseline_nl_km |   .0016619   .0171199     0.10   0.923    -.0319532    .0352769
high_school_percent |   .0093654   .0015077     6.21   0.000     .0064051    .0123257
      ageatelection |  -.0005216   .0006318    -0.83   0.409    -.0017623     .000719
             female |    .061664   .0503927     1.22   0.222    -.0372824    .1606103
     gov_coalitiion |   -.020317    .011815    -1.72   0.086    -.0435158    .0028818
            ln_popn |   .0660817   .0119268     5.54   0.000     .0426633    .0895001
          urban_num |  -.0305451   .0170186    -1.79   0.073    -.0639613    .0028711
              _cons |  -.3068519   .1282078    -2.39   0.017    -.5585887   -.0551151
-------------------------------------------------------------------------------------

. outreg2 using v3_lisa_regression.doc, append dec(3)
v3_lisa_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. regress local_cop neighbor_percent, r

Linear regression                               Number of obs     =        691
                                                F(1, 689)         =       8.26
                                                Prob > F          =     0.0042
                                                R-squared         =     0.0127
                                                Root MSE          =     30.576

----------------------------------------------------------------------------------
                 |               Robust
       local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
neighbor_percent |   .2716404   .0945331     2.87   0.004     .0860329    .4572479
           _cons |   27.92648   1.881371    14.84   0.000     24.23258    31.62039
----------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, replace dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent, r

Linear regression                               Number of obs     =        691
                                                F(2, 688)         =      28.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0815
                                                Root MSE          =     29.513

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1423194    .090909     1.57   0.118     -.036173    .3208119
high_school_percent |   1.618791   .2328552     6.95   0.000     1.161599    2.075983
              _cons |   13.59103    2.64779     5.13   0.000     8.392312    18.78975
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn, r

Linear regression                               Number of obs     =        691
                                                F(3, 687)         =      22.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1009
                                                Root MSE          =     29.221

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1825309   .0925541     1.97   0.049      .000808    .3642538
high_school_percent |   1.287932   .2441556     5.28   0.000     .8085509    1.767312
            ln_popn |   5.871562   1.593604     3.68   0.000     2.742643    9.000481
              _cons |  -43.78757    15.9128    -2.75   0.006    -75.03113   -12.54401
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num, r

Linear regression                               Number of obs     =        691
                                                F(4, 686)         =      17.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1025
                                                Root MSE          =     29.217

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1767311   .0925811     1.91   0.057    -.0050452    .3585073
high_school_percent |   1.234445   .2509894     4.92   0.000     .7416456    1.727245
            ln_popn |   4.731611   1.887557     2.51   0.012      1.02553    8.437693
          urban_num |   3.234906   3.023877     1.07   0.285    -2.702259    9.172071
              _cons |  -32.75622   18.73338    -1.75   0.081    -69.53786    4.025414
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection, r

Linear regression                               Number of obs     =        691
                                                F(5, 685)         =      15.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1088
                                                Root MSE          =     29.135

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1600276   .0933913     1.71   0.087    -.0233401    .3433952
high_school_percent |   1.193161   .2511441     4.75   0.000     .7000563    1.686265
            ln_popn |   4.263404   1.891554     2.25   0.025     .5494646    7.977344
          urban_num |   3.524042   3.007714     1.17   0.242    -2.381404    9.429488
      ageatelection |   .2645701   .1256351     2.11   0.036      .017894    .5112462
              _cons |  -40.20629   19.03704    -2.11   0.035    -77.58424   -2.828335
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female, r

Linear regression                               Number of obs     =        691
                                                F(6, 684)         =      13.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1093
                                                Root MSE          =     29.148

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .1605784   .0934513     1.72   0.086    -.0229074    .3440643
high_school_percent |   1.184151     .25203     4.70   0.000     .6893054    1.678996
            ln_popn |   4.256765    1.88986     2.25   0.025     .5461415    7.967388
          urban_num |   3.572107   3.003922     1.19   0.235    -2.325908    9.470121
      ageatelection |    .270528   .1259382     2.15   0.032     .0232561    .5177998
             female |   4.948424   8.290264     0.60   0.551      -11.329    21.22584
              _cons |  -40.46371   19.04782    -2.12   0.034    -77.86293   -3.064498
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admin_per bu
> dg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per, r

Linear regression                               Number of obs     =        691
                                                F(15, 675)        =      27.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3379
                                                Root MSE          =     25.298

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |   .0471587   .0820061     0.58   0.565     -.113859    .2081765
high_school_percent |   .3376843   .2271602     1.49   0.138    -.1083414    .7837099
            ln_popn |   2.361567   1.654352     1.43   0.154    -.8867267    5.609861
          urban_num |   1.701347   2.655963     0.64   0.522    -3.513596    6.916291
      ageatelection |   .2355786   .1084093     2.17   0.030     .0227185    .4484387
             female |   3.419645   6.855979     0.50   0.618    -10.04196    16.88125
       gov_magm_per |   .0685007   .1034031     0.66   0.508    -.1345298    .2715312
      org_admin_per |  -.0001014   .0839321    -0.00   0.999    -.1649008     .164698
      budg_magm_per |   .0551657   .0983858     0.56   0.575    -.1380134    .2483448
    fiscal_magm_per |   .1663015   .1022272     1.63   0.104      -.03442     .367023
    service_dev_per |   .1076419   .1126124     0.96   0.339    -.1134707    .3287546
        jud_exe_per |   .0670716   .0743632     0.90   0.367    -.0789394    .2130825
      phy_infra_per |   .2654826   .0797484     3.33   0.001     .1088979    .4220674
        soc_inc_per |   .0502472   .0661405     0.76   0.448    -.0796186     .180113
     env_protec_per |   .4430052   .0944505     4.69   0.000     .2575531    .6284573
              _cons |  -74.17046   17.29388    -4.29   0.000    -108.1267    -40.2142
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
. regress local_cop neighbor_percent high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admin_per bu
> dg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per fed_cop ddc_cop, r

Linear regression                               Number of obs     =        691
                                                F(17, 673)        =      46.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4893
                                                Root MSE          =      22.25

-------------------------------------------------------------------------------------
                    |               Robust
          local_cop | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
   neighbor_percent |    .053051   .0711325     0.75   0.456    -.0866172    .1927193
high_school_percent |   .2664227     .18945     1.41   0.160    -.1055615     .638407
            ln_popn |   3.415685   1.552848     2.20   0.028      .366675    6.464695
          urban_num |   2.626003   2.337179     1.12   0.262    -1.963035    7.215042
      ageatelection |   .1123757   .0941527     1.19   0.233    -.0724927     .297244
             female |   4.670075   5.017826     0.93   0.352    -5.182401    14.52255
       gov_magm_per |  -.0908637   .0923089    -0.98   0.325    -.2721118    .0903845
      org_admin_per |  -.0307207   .0758007    -0.41   0.685    -.1795551    .1181136
      budg_magm_per |   .1124167   .0838701     1.34   0.181    -.0522618    .2770952
    fiscal_magm_per |   .1057795   .0908147     1.16   0.245    -.0725346    .2840937
    service_dev_per |   .1210887   .1021073     1.19   0.236    -.0793985    .3215759
        jud_exe_per |   .0345522   .0655242     0.53   0.598    -.0941043    .1632087
      phy_infra_per |   .1411736   .0684082     2.06   0.039     .0068544    .2754927
        soc_inc_per |  -.0916181   .0613368    -1.49   0.136    -.2120526    .0288163
     env_protec_per |   .2470592   .0828088     2.98   0.003     .0844645     .409654
            fed_cop |   .3880157   .0391144     9.92   0.000     .3112148    .4648167
            ddc_cop |   .1493808   .0280754     5.32   0.000     .0942549    .2045067
              _cons |  -60.54327   15.47474    -3.91   0.000    -90.92785    -30.1587
-------------------------------------------------------------------------------------

. outreg2 using instru_regression.doc, append dec(3)
instru_regression.doc
dir : seeout

. 
end of do-file

. ivregress 2sls rel_chgnl high_school_per ageatelection (local_cop = neighbor_percent)

Instrumental variables 2SLS regression            Number of obs   =        691
                                                  Wald chi2(3)    =      98.57
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1315
                                                  Root MSE        =     .15279

---------------------------------------------------------------------------------
      rel_chgnl | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      local_cop |   .0009877   .0036825     0.27   0.789      -.00623    .0082053
high_school_per |   .0096895   .0060531     1.60   0.109    -.0021742    .0215533
  ageatelection |  -.0000724   .0013244    -0.05   0.956    -.0026682    .0025235
          _cons |   .2112005   .0316265     6.68   0.000     .1492138    .2731873
---------------------------------------------------------------------------------
Endogenous: local_cop
Exogenous:  high_school_per ageatelection neighbor_percent

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. ivregress 2sls rel_chgnl neighbor_percent high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admin
> _per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per fed_cop ddc_cop (lo
> cal_cop = neighbor_percent)
equation not identified; must have at least as many instruments not in
the regression as there are instrumented variables
r(481);

end of do-file

r(481);

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. ivregress 2sls rel_chgnl neighbor_percent high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admin
> _per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per fed_cop ddc_cop (lo
> cal_cop = neighbor_percent)
equation not identified; must have at least as many instruments not in
the regression as there are instrumented variables
r(481);

end of do-file

r(481);

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. ivregress 2sls rel_chgnl high_school_per ageatelection (local_cop = neighbor_percent)

Instrumental variables 2SLS regression            Number of obs   =        691
                                                  Wald chi2(3)    =      98.57
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1315
                                                  Root MSE        =     .15279

---------------------------------------------------------------------------------
      rel_chgnl | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      local_cop |   .0009877   .0036825     0.27   0.789      -.00623    .0082053
high_school_per |   .0096895   .0060531     1.60   0.109    -.0021742    .0215533
  ageatelection |  -.0000724   .0013244    -0.05   0.956    -.0026682    .0025235
          _cons |   .2112005   .0316265     6.68   0.000     .1492138    .2731873
---------------------------------------------------------------------------------
Endogenous: local_cop
Exogenous:  high_school_per ageatelection neighbor_percent

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. ivregress 2sls rel_chgnl ln_baseline_nl_km high_school_per ageatelection (local_cop = neighbor_percent)

Instrumental variables 2SLS regression            Number of obs   =        691
                                                  Wald chi2(4)    =      56.69
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .22593

-----------------------------------------------------------------------------------
        rel_chgnl | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------+----------------------------------------------------------------
        local_cop |   .0064071   .0060362     1.06   0.288    -.0054236    .0182378
ln_baseline_nl_km |   .0618304    .018438     3.35   0.001     .0256926    .0979682
  high_school_per |  -.0013975    .010238    -0.14   0.891    -.0214635    .0186686
    ageatelection |  -.0021625   .0021758    -0.99   0.320     -.006427    .0021021
            _cons |   .2300559   .0470063     4.89   0.000     .1379252    .3221865
-----------------------------------------------------------------------------------
Endogenous: local_cop
Exogenous:  ln_baseline_nl_km high_school_per ageatelection neighbor_percent

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. ivregress 2sls rel_chgnl ln_baseline_nl_km high_school_percent ageatelection (local_cop = neighbor_percent)

Instrumental variables 2SLS regression            Number of obs   =        691
                                                  Wald chi2(4)    =      56.68
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .22595

-------------------------------------------------------------------------------------
          rel_chgnl | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0064081   .0060379     1.06   0.289     -.005426    .0182422
  ln_baseline_nl_km |   .0618348   .0184418     3.35   0.001     .0256896      .09798
high_school_percent |  -.0014001   .0102417    -0.14   0.891    -.0214734    .0186732
      ageatelection |  -.0021627   .0021763    -0.99   0.320    -.0064283    .0021028
              _cons |   .2300628   .0470107     4.89   0.000     .1379236     .322202
-------------------------------------------------------------------------------------
Endogenous: local_cop
Exogenous:  ln_baseline_nl_km high_school_percent ageatelection neighbor_percent

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. ivregress 2sls rel_chgnl ln_baseline_nl_km high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admi
> n_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per fed_cop ddc_cop (l
> ocal_cop = neighbor_percent)

Instrumental variables 2SLS regression            Number of obs   =        691
                                                  Wald chi2(18)   =      39.74
                                                  Prob > chi2     =     0.0023
                                                  R-squared       =          .
                                                  Root MSE        =     .31201

-------------------------------------------------------------------------------------
          rel_chgnl | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0132803   .0179546     0.74   0.460      -.02191    .0484707
  ln_baseline_nl_km |  -.0022476   .0306414    -0.07   0.942    -.0623035    .0578083
high_school_percent |   .0057786    .005939     0.97   0.331    -.0058616    .0174188
            ln_popn |   .0222144   .0637917     0.35   0.728     -.102815    .1472439
          urban_num |  -.0643449    .059287    -1.09   0.278    -.1805454    .0518556
      ageatelection |  -.0018382   .0024809    -0.74   0.459    -.0067007    .0030244
             female |   -.001136   .1184156    -0.01   0.992    -.2332264    .2309544
       gov_magm_per |    .000472   .0021485     0.22   0.826    -.0037389     .004683
      org_admin_per |   .0003131   .0011815     0.26   0.791    -.0020027    .0026289
      budg_magm_per |  -.0012961   .0023011    -0.56   0.573    -.0058062    .0032141
    fiscal_magm_per |  -.0021358   .0023255    -0.92   0.358    -.0066936     .002422
    service_dev_per |  -.0006348   .0025931    -0.24   0.807    -.0057171    .0044476
        jud_exe_per |   -.001482   .0011851    -1.25   0.211    -.0038048    .0008408
      phy_infra_per |  -.0013597   .0027426    -0.50   0.620    -.0067351    .0040156
        soc_inc_per |   .0011324   .0018167     0.62   0.533    -.0024284    .0046931
     env_protec_per |  -.0041179   .0045498    -0.91   0.365    -.0130352    .0047995
            fed_cop |  -.0046996    .006969    -0.67   0.500    -.0183585    .0089594
            ddc_cop |  -.0019192   .0027223    -0.71   0.481    -.0072549    .0034164
              _cons |   .4717321   1.093532     0.43   0.666    -1.671552    2.615016
-------------------------------------------------------------------------------------
Endogenous: local_cop
Exogenous:  ln_baseline_nl_km high_school_percent ln_popn urban_num ageatelection
            female gov_magm_per org_admin_per budg_magm_per fiscal_magm_per
            service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per
            fed_cop ddc_cop neighbor_percent

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. ivregress 2sls rel_chgnl ln_baseline_nl_km high_school_percent ln_popn urban_num ageatelection female gov_magm_per org_admi
> n_per budg_magm_per fiscal_magm_per service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per fed_cop ddc_cop (l
> ocal_cop = neighbor_percent)

Instrumental variables 2SLS regression            Number of obs   =        691
                                                  Wald chi2(18)   =      39.74
                                                  Prob > chi2     =     0.0023
                                                  R-squared       =          .
                                                  Root MSE        =     .31201

-------------------------------------------------------------------------------------
          rel_chgnl | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
          local_cop |   .0132803   .0179546     0.74   0.460      -.02191    .0484707
  ln_baseline_nl_km |  -.0022476   .0306414    -0.07   0.942    -.0623035    .0578083
high_school_percent |   .0057786    .005939     0.97   0.331    -.0058616    .0174188
            ln_popn |   .0222144   .0637917     0.35   0.728     -.102815    .1472439
          urban_num |  -.0643449    .059287    -1.09   0.278    -.1805454    .0518556
      ageatelection |  -.0018382   .0024809    -0.74   0.459    -.0067007    .0030244
             female |   -.001136   .1184156    -0.01   0.992    -.2332264    .2309544
       gov_magm_per |    .000472   .0021485     0.22   0.826    -.0037389     .004683
      org_admin_per |   .0003131   .0011815     0.26   0.791    -.0020027    .0026289
      budg_magm_per |  -.0012961   .0023011    -0.56   0.573    -.0058062    .0032141
    fiscal_magm_per |  -.0021358   .0023255    -0.92   0.358    -.0066936     .002422
    service_dev_per |  -.0006348   .0025931    -0.24   0.807    -.0057171    .0044476
        jud_exe_per |   -.001482   .0011851    -1.25   0.211    -.0038048    .0008408
      phy_infra_per |  -.0013597   .0027426    -0.50   0.620    -.0067351    .0040156
        soc_inc_per |   .0011324   .0018167     0.62   0.533    -.0024284    .0046931
     env_protec_per |  -.0041179   .0045498    -0.91   0.365    -.0130352    .0047995
            fed_cop |  -.0046996    .006969    -0.67   0.500    -.0183585    .0089594
            ddc_cop |  -.0019192   .0027223    -0.71   0.481    -.0072549    .0034164
              _cons |   .4717321   1.093532     0.43   0.666    -1.671552    2.615016
-------------------------------------------------------------------------------------
Endogenous: local_cop
Exogenous:  ln_baseline_nl_km high_school_percent ln_popn urban_num ageatelection
            female gov_magm_per org_admin_per budg_magm_per fiscal_magm_per
            service_dev_per jud_exe_per phy_infra_per soc_inc_per env_protec_per
            fed_cop ddc_cop neighbor_percent

. outreg2 using instru_regression.doc, replace dec(3)
instru_regression.doc
dir : seeout

. 
end of do-file

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. graph pie politicalaffiliation
string variables not allowed in varlist;
politicalaffiliation is a string variable
r(109);

end of do-file

r(109);

. do "/var/folders/77/r2kbz41j5hz_44s8bp00q04m0000gn/T//SD14229.000000"

. summarize politicalaffiliation

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
politicala~n |          0

. 
end of do-file

