-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/MainDataSet.log
  log type:  text
 opened on:  18 Jul 2024, 11:57:16

. 
. // Load data
. import delimited "/Users/apanta1/Desktop/Summer Research 2024/Night_Light_Institutional_Capacity/Stata/Local_Gov_Dataset_of
> _Nepal.csv", clear
(encoding automatically selected: UTF-8)
(70 vars, 753 obs)

. 
. // removing empty rows
. drop if missing(unit_name)
(0 observations deleted)

. 
. //droping municipality without data
. drop if lisa_20_21 == "N/A"
(53 observations deleted)

. drop if lisa_21_22 == "N/A"
(8 observations deleted)

. 
. // replace lisa_total_100_20_21 =lisa_total_100_21_22 if lisa_total_100_20_21 == "N/A", 
. 
. // changing scores to numbers
. destring lisa_20_21, replace
lisa_20_21: all characters numeric; replaced as double

. destring lisa_21_22, replace
lisa_21_22: all characters numeric; replaced as double

. 
. 
. egen baseline_nl = rowmean(sum_2014 sum_2015 sum_2016 sum_2017)

. 
. gen ln_baseline_nl_km = log(baseline_nl/area_kmsq)

. 
. generate rel_chgnl  = (log(sum_2021) - log(sum_2017))

. 
. gen ln_popn = log(popn_2021)

. 
. gen high_school_percent= (((popn_highschool+popn_graduate+popn_post_graduate)/popn_2021) * 100)

. 
. gen urban_num = 0

. replace urban_num = 1 if unit_type != "Gaunpalika"
(272 real changes made)

. 
. gen gov_coalitiion = 0

. replace gov_coalitiion = 1 if politicalaffiliation == "CPN-MC" | politicalaffiliation == "CPN-UML" | politicalaffiliation =
> = "FSFN" | politicalaffiliation == "NSP"
(407 real changes made)

. 
. gen female = 0

. replace female = 1 if sex =="Female"
(14 real changes made)

. 
. egen lisa_avg = rowmean(lisa_20_21 lisa_21_22)

. 
. // regressions
. 
. regress rel_chgnl  ln_baseline_nl_km, r

Linear regression                               Number of obs     =        692
                                                F(1, 690)         =      35.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0802
                                                Root MSE          =     .15737

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
ln_baseline_nl_km |    .081255   .0137281     5.92   0.000     .0543011    .1082089
            _cons |   .3125455   .0053833    58.06   0.000     .3019758    .3231152
-----------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, replace dec(3)
v3_intial_regression.doc
dir : seeout

. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg, r

Linear regression                               Number of obs     =        692
                                                F(2, 689)         =      23.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0923
                                                Root MSE          =     .15645

-----------------------------------------------------------------------------------
                  |               Robust
        rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
ln_baseline_nl_km |   .0824295   .0133367     6.18   0.000      .056244     .108615
         lisa_avg |    .001399   .0005803     2.41   0.016     .0002597    .0025383
            _cons |   .2252008   .0370944     6.07   0.000     .1523691    .2980324
-----------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg high_school_percent, r

Linear regression                               Number of obs     =        692
                                                F(3, 688)         =      37.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1531
                                                Root MSE          =     .15122

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
  ln_baseline_nl_km |   .0531208    .013081     4.06   0.000     .0274373    .0788042
           lisa_avg |   .0002114   .0005778     0.37   0.715    -.0009231    .0013458
high_school_percent |   .0090826   .0013747     6.61   0.000     .0063836    .0117817
              _cons |   .2158938   .0361428     5.97   0.000     .1449303    .2868572
-------------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg high_school_percent, r

Linear regression                               Number of obs     =        692
                                                F(3, 688)         =      37.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1531
                                                Root MSE          =     .15122

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
  ln_baseline_nl_km |   .0531208    .013081     4.06   0.000     .0274373    .0788042
           lisa_avg |   .0002114   .0005778     0.37   0.715    -.0009231    .0013458
high_school_percent |   .0090826   .0013747     6.61   0.000     .0063836    .0117817
              _cons |   .2158938   .0361428     5.97   0.000     .1449303    .2868572
-------------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg high_school_percent ageatelection, r

Linear regression                               Number of obs     =        692
                                                F(4, 687)         =      28.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1531
                                                Root MSE          =     .15133

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
  ln_baseline_nl_km |   .0533244   .0133501     3.99   0.000     .0271125    .0795364
           lisa_avg |   .0002178   .0005781     0.38   0.706    -.0009172    .0013528
high_school_percent |   .0090937   .0013709     6.63   0.000      .006402    .0117853
      ageatelection |   -.000101   .0006257    -0.16   0.872    -.0013295    .0011275
              _cons |   .2202167   .0470585     4.68   0.000      .127821    .3126124
-------------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg high_school_percent ageatelection gov_coalitiion, r

Linear regression                               Number of obs     =        692
                                                F(5, 686)         =      22.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1555
                                                Root MSE          =     .15123

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
  ln_baseline_nl_km |   .0523857   .0132223     3.96   0.000     .0264247    .0783467
           lisa_avg |   .0002615   .0005741     0.46   0.649    -.0008656    .0013886
high_school_percent |   .0092817   .0013757     6.75   0.000     .0065807    .0119827
      ageatelection |  -.0002089   .0006373    -0.33   0.743    -.0014603    .0010425
     gov_coalitiion |  -.0165372   .0118975    -1.39   0.165     -.039897    .0068226
              _cons |   .2308417   .0489644     4.71   0.000     .1347036    .3269798
-------------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg high_school_percent ageatelection gov_coalitiion female, r

Linear regression                               Number of obs     =        692
                                                F(6, 685)         =      20.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1587
                                                Root MSE          =     .15105

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
  ln_baseline_nl_km |   .0533063    .013096     4.07   0.000     .0275932    .0790194
           lisa_avg |   .0002548   .0005749     0.44   0.658    -.0008739    .0013835
high_school_percent |   .0091532   .0013831     6.62   0.000     .0064376    .0118688
      ageatelection |  -.0001332   .0006433    -0.21   0.836    -.0013962    .0011298
     gov_coalitiion |  -.0164799   .0119251    -1.38   0.167     -.039894    .0069342
             female |   .0659501   .0494918     1.33   0.183    -.0312237    .1631239
              _cons |   .2272351   .0490152     4.64   0.000      .130997    .3234731
-------------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg high_school_percent ageatelection gov_coalitiion female ln_popn, r

Linear regression                               Number of obs     =        692
                                                F(7, 684)         =      22.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1889
                                                Root MSE          =     .14843

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
  ln_baseline_nl_km |    .008447   .0164617     0.51   0.608    -.0238745    .0407685
           lisa_avg |  -.0002187   .0005825    -0.38   0.707    -.0013625    .0009251
high_school_percent |   .0086687   .0013481     6.43   0.000     .0060217    .0113157
      ageatelection |  -.0002273   .0006208    -0.37   0.714    -.0014461    .0009915
     gov_coalitiion |  -.0178251   .0116999    -1.52   0.128    -.0407971    .0051468
             female |   .0599584   .0498243     1.20   0.229    -.0378685    .1577853
            ln_popn |   .0504897   .0089573     5.64   0.000     .0329026    .0680768
              _cons |  -.2352986   .0939587    -2.50   0.013    -.4197807   -.0508166
-------------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
. 
. regress rel_chgnl  ln_baseline_nl_km lisa_avg high_school_percent ageatelection gov_coalitiion female ln_popn urban_num, r

Linear regression                               Number of obs     =        692
                                                F(8, 683)         =      18.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1915
                                                Root MSE          =     .14829

-------------------------------------------------------------------------------------
                    |               Robust
          rel_chgnl | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
  ln_baseline_nl_km |   .0057254   .0165534     0.35   0.730    -.0267763    .0382272
           lisa_avg |  -.0002189    .000587    -0.37   0.709    -.0013715    .0009338
high_school_percent |   .0091351   .0014114     6.47   0.000     .0063639    .0119062
      ageatelection |  -.0002661   .0006214    -0.43   0.669    -.0014862    .0009539
     gov_coalitiion |  -.0190237     .01174    -1.62   0.106    -.0420745     .004027
             female |   .0578606   .0495785     1.17   0.244     -.039484    .1552052
            ln_popn |   .0596759   .0111321     5.36   0.000     .0378187    .0815331
          urban_num |  -.0227789   .0168128    -1.35   0.176      -.05579    .0102321
              _cons |  -.3215681   .1165079    -2.76   0.006    -.5503248   -.0928115
-------------------------------------------------------------------------------------

. outreg2 using v3_intial_regression.doc, append dec(3)
v3_intial_regression.doc
dir : seeout

. 
end of do-file

. exit, clear
